HaiMianBBao/PlumBL/PlumUSB/port/ch579/ch579_regs.h
/* Define for CH579         */
/* Website:  http://wch.cn  */
/* Email:    tech@wch.cn    */
/* Author:   W.ch 2016.10   */
/* V0.3 SpecialFunctionRegister */

// multi-blocks: __BASE_TYPE__, __CH579SFR_H__, __CH579ETHSFR_H__, __CH579USBSFR_H__, __USB_TYPE__...

#ifndef __BASE_TYPE__
#define __BASE_TYPE__

#ifdef __cplusplus
extern "C"
{
#endif

    /* ********************************************************************************************************************* */
    /* Base types & constants */

#ifndef TRUE
#define TRUE 1
#define FALSE 0
#endif
#ifndef NULL
#define NULL 0
#endif

#ifndef VOID
#define VOID void
#endif
#ifndef CONST
#define CONST const
#endif
#ifndef BOOL
    typedef unsigned char BOOL;
#endif
#ifndef BOOLEAN
    typedef unsigned char BOOLEAN;
#endif
#ifndef CHAR
    typedef char CHAR;
#endif
#ifndef INT8
    typedef char INT8;
#endif
#ifndef INT16
    typedef short INT16;
#endif
#ifndef INT32
    typedef long INT32;
#endif
#ifndef UINT8
    typedef unsigned char UINT8;
#endif
#ifndef UINT16
    typedef unsigned short UINT16;
#endif
#ifndef UINT32
    typedef unsigned long UINT32;
#endif
#ifndef UINT8V
    typedef unsigned char volatile UINT8V;
#endif
#ifndef UINT16V
    typedef unsigned short volatile UINT16V;
#endif
#ifndef UINT32V
    typedef unsigned long volatile UINT32V;
#endif

#ifndef PVOID
    typedef void *PVOID;
#endif
#ifndef PCHAR
    typedef char *PCHAR;
#endif
#ifndef PCHAR
    typedef const char *PCCHAR;
#endif
#ifndef PINT8
    typedef char *PINT8;
#endif
#ifndef PINT16
    typedef short *PINT16;
#endif
#ifndef PINT32
    typedef long *PINT32;
#endif
#ifndef PUINT8
    typedef unsigned char *PUINT8;
#endif
#ifndef PUINT16
    typedef unsigned short *PUINT16;
#endif
#ifndef PUINT32
    typedef unsigned long *PUINT32;
#endif
#ifndef PUINT8V
    typedef volatile unsigned char *PUINT8V;
#endif
#ifndef PUINT16V
    typedef volatile unsigned short *PUINT16V;
#endif
#ifndef PUINT32V
    typedef volatile unsigned long *PUINT32V;
#endif

    /* ********************************************************************************************************************* */
    /* Base macros */

#ifndef min
#define min(a, b) (((a) < (b)) ? (a) : (b))
#endif
#ifndef max
#define max(a, b) (((a) > (b)) ? (a) : (b))
#endif

#ifdef DEBUG
#define PRINT(X...) printf(X)
#else
#define PRINT(X...)
#endif

/* Calculate the byte offset of a field in a structure of type */
#define FIELD_OFFSET(Type, Field) ((UINT16) & (((Type *)0)->Field))

/* Calculate the size of a field in a structure of type */
#define FIELD_SIZE(Type, Field) (sizeof(((Type *)0)->Field))

/* An expression that yields the type of a field in a struct */
#define FIELD_TYPE(Type, Field) (((Type *)0)->Field)

/* Return the number of elements in a statically sized array */
#define NUMBER_OF(Array) (sizeof(Array) / sizeof((Array)[0]))
#define NUMBER_OF_FIELD(Type, Field) (NUMBER_OF(FIELD_TYPE(Type, Field)))

#ifdef __cplusplus
}
#endif

#endif // __BASE_TYPE__

#ifndef __CH579SFR_H__
#define __CH579SFR_H__

#ifdef __cplusplus
extern "C"
{
#endif

/* ********************************************************************************************************************* */

// Address Space
//    CODE:   00000000H - 0003FFFFH   256K
//    DATA:   20000000H - 20007FFFH   32KB
//    SFR:    40000000H - 4000FFFFH   64KB
//    PPB:    E0000000H - E000FFFFH   64KB
//
//    SFR:    40000000H - 4000FFFFH,  64KB
//      SYS:     +1000H - 1BFFH, include base configuration, interrupt, GPIO, etc...
//      TMR0:    +2000H - 23FFH
//      TMR1:    +2400H - 27FFH
//      TMR2:    +2800H - 2BFFH
//      TMR3:    +2C00H - 2FFFH
//      UART0:   +3000H - 33FFH
//      UART1:   +3400H - 37FFH
//      UART2:   +3800H - 3BFFH
//      UART3:   +3C00H - 3FFFH
//      SPI0:    +4000H - 43FFH
//      SPI1:    +4400H - 47FFH
//      PWMx:    +5000H - 53FFH
//      LCD:     +6000H - 63FFH
//      LED:     +6400H - 67FFH
//      USB:     +8000H - 83FFH
//      ETH:     +9000H - 93FFH
//      BLE:     +C000H - D3FFH

// Register Bit Attribute / Bit Access Type
//   RF:    Read only for Fixed value
//   RO:    Read Only (internal change)
//   RZ:    Read only with auto clear Zero
//   WO:    Write Only (read zero or different)
//   WA:    Write only under safe Accessing mode (read zero or different)
//   WZ:    Write only with auto clear Zero
//   RW:    Read / Write
//   RWA:   Read / Write under safe Accessing mode
//   RW1:   Read / Write 1 to Clear

/* Register name rule:
   R32_* for 32 bits register (UINT32,ULONG)
   R16_* for 16 bits register (UINT16,USHORT)
   R8_*  for  8 bits register (UINT8,UCHAR)
   RB_*  for bit or bit mask of 8 bit register
   BA_*  for base address point
   b*    for GPIO bit mask
   Others for register address offset */

/* ********************************************************************************************************************* */

/* System: safe accessing register */
#define R32_SAFE_ACCESS (*((PUINT32V)0x40001040))   // RW, safe accessing
#define R8_SAFE_ACCESS_SIG (*((PUINT8V)0x40001040)) // WO, safe accessing sign register, must write SAFE_ACCESS_SIG1 then SAFE_ACCESS_SIG2 to enter safe accessing mode
#define RB_SAFE_ACC_MODE 0x03                       // RO, current safe accessing mode: 11=safe/unlocked (SAM), other=locked (00..01..10..11)
#define RB_SAFE_ACC_ACT 0x08                        // RO, indicate safe accessing status now: 0=locked, read only, 1=safe/unlocked (SAM), write enabled
#define RB_SAFE_ACC_TIMER 0x70                      // RO, safe accessing timer bit mask (16*clock number)
#define SAFE_ACCESS_SIG1 0x57                       // WO: safe accessing sign value step 1
#define SAFE_ACCESS_SIG2 0xA8                       // WO: safe accessing sign value step 2
#define SAFE_ACCESS_SIG0 0x00                       // WO: safe accessing sign value for disable
#define R8_CHIP_ID (*((PUINT8V)0x40001041))         // RF, chip ID register, always is ID_CH57*
#define R8_SAFE_ACCESS_ID (*((PUINT8V)0x40001042))  // RF, safe accessing ID register, always 0x04
#define R8_WDOG_COUNT (*((PUINT8V)0x40001043))      // RW, watch-dog count, count by clock frequency Fsys/131072

/* System: global configuration register */
#define R32_GLOBAL_CONFIG (*((PUINT32V)0x40001044)) // RW, global configuration
#define R8_RESET_STATUS (*((PUINT8V)0x40001044))    // RWA, reset status, SAM
#define RB_RESET_FLAG 0x07                          // RO: recent reset flag
#define RST_FLAG_SW 0x00
#define RST_FLAG_RPOR 0x01
#define RST_FLAG_WTR 0x02
#define RST_FLAG_MR 0x03
//#define  RST_FLAG_GPWSM     0x04                      // RO, power on reset flag during sleep/shutdown: 0=no power on reset during sleep/shutdown, 1=power on reset occurred during sleep/shutdown
#define RST_FLAG_GPWSM 0x05
#define RB_ROM_CODE_OFS 0x10 // RWA, code offset address selection in Flash ROM: 0=start address 0x000000, 1=start address 0x008000
// RB_RESET_FLAG: recent reset flag
//   000 - SR, software reset, by RB_SOFTWARE_RESET=1 @RB_WDOG_RST_EN=0
//   001 - RPOR, real power on reset
//   010 - WTR, watch-dog timer-out reset
//   011 - MR, external manual reset by RST pin input low
//   101 - GRWSM, global reset by waking under shutdown mode
//   1?? - LRW, power on reset occurred during sleep
#define R8_GLOB_CFG_INFO (*((PUINT8V)0x40001045))   // RO, global configuration information and status
#define RB_CFG_ROM_READ 0x01                        // RO, indicate protected status of Flash ROM code and data: 0=reading protect, 1=enable read by external programmer
#define RB_CFG_RESET_EN 0x04                        // RO, manual reset input enable status
#define RB_CFG_BOOT_EN 0x08                         // RO, boot-loader enable status
#define RB_CFG_DEBUG_EN 0x10                        // RO, debug enable status
#define RB_BOOT_LOADER 0x20                         // RO, indicate boot loader status: 0=application status (by software reset), 1=boot loader status
#define R8_RST_WDOG_CTRL (*((PUINT8V)0x40001046))   // RWA, reset and watch-dog control, SAM
#define RB_SOFTWARE_RESET 0x01                      // WA/WZ, global software reset, high action, auto clear
#define RB_WDOG_RST_EN 0x02                         // RWA, enable watch-dog reset if watch-dog timer overflow: 0=as timer only, 1=enable reset if timer overflow
#define RB_WDOG_INT_EN 0x04                         // RWA, watch-dog timer overflow interrupt enable: 0=disable, 1=enable
#define RB_WDOG_INT_FLAG 0x10                       // RW1, watch-dog timer overflow interrupt flag, cleared by RW1 or reload watch-dog count or __SEV(Send-Event)
#define R8_GLOB_RESET_KEEP (*((PUINT8V)0x40001047)) // RW, value keeper during global reset

/* System: clock configuration register */
#define R32_CLOCK_CONFIG (*((PUINT32V)0x40001008)) // RWA, clock configuration, SAM
#define R16_CLK_SYS_CFG (*((PUINT16V)0x40001008))  // RWA, system clock configuration, SAM
#define RB_CLK_PLL_DIV 0x1F                        // RWA, output clock divider from PLL or CK32M
#define RB_CLK_SYS_MOD 0xC0                        // RWA, system clock source mode: 00=divided from 32MHz, 01=divided from PLL-480MHz, 10=directly from 32MHz, 11=directly from 32KHz
#define RB_CLK_OSC32M_XT 0x0200                    // RWA, 32MHz clock source selection: 0=internal 32MHz oscillator, 1=external 32MHz oscillator
#define RB_XO_DI 0x8000                            // RO, X32MO input status sample value
#define R8_HFCK_PWR_CTRL (*((PUINT8V)0x4000100A))  // RWA, high frequency clock module power control, SAM
#define RB_CLK_XT32M_PON 0x04                      // RWA, external 32MHz oscillator power control: 0=power down, 1-power on
#define RB_CLK_INT32M_PON 0x08                     // RWA, internal 32MHz oscillator power control: 0=power down, 1-power on
#define RB_CLK_PLL_PON 0x10                        // RWA, PLL power control: 0=power down, 1-power on
// Fck32m = RB_CLK_OSC32M_XT ? XT_32MHz : RC_32MHz
// Fck32k = RB_CLK_OSC32K_XT ? XT_32KHz : RC_32KHz
// Fpll = Fck32m * 15 = 480MHz
// Fsys = RB_CLK_SYS_MOD[1] ? ( RB_CLK_SYS_MOD[0] ? Fck32k : Fck32m ) : ( ( RB_CLK_SYS_MOD[0] ? Fpll : Fck32m ) / RB_CLK_PLL_DIV )
// default: Fsys = Fck32m / RB_CLK_PLL_DIV = 32MHz / 5 = 6.4MHz
//   range: 32KHz, 1MHz~16MHz, 32MHz, 15MHz~48MHz

