HaiMianBBao/PlumBL/PlumUSB/port/ch579/ch579_regs.h
/* System: sleep control register */
#define R32_SLEEP_CONTROL (*((PUINT32V)0x4000100C)) // RWA, sleep control, SAM
#define R8_SLP_CLK_OFF0 (*((PUINT8V)0x4000100C))    // RWA, sleep clock off control byte 0, SAM
#define RB_SLP_CLK_TMR0 0x01                        // RWA, close TMR0 clock
#define RB_SLP_CLK_TMR1 0x02                        // RWA, close TMR1 clock
#define RB_SLP_CLK_TMR2 0x04                        // RWA, close TMR2 clock
#define RB_SLP_CLK_TMR3 0x08                        // RWA, close TMR3 clock
#define RB_SLP_CLK_UART0 0x10                       // RWA, close UART0 clock
#define RB_SLP_CLK_UART1 0x20                       // RWA, close UART1 clock
#define RB_SLP_CLK_UART2 0x40                       // RWA, close UART2 clock
#define RB_SLP_CLK_UART3 0x80                       // RWA, close UART3 clock
#define R8_SLP_CLK_OFF1 (*((PUINT8V)0x4000100D))    // RWA, sleep clock off control byte 1, SAM
#define RB_SLP_CLK_SPI0 0x01                        // RWA, close SPI0 clock
#define RB_SLP_CLK_SPI1 0x02                        // RWA, close SPI1 clock
#define RB_SLP_CLK_PWMX 0x04                        // RWA, close PWMx clock
#define RB_SLP_CLK_LCD 0x08                         // RWA, close LCD clock
#define RB_SLP_CLK_USB 0x10                         // RWA, close USB clock
#define RB_SLP_CLK_ETH 0x20                         // RWA, close ETH clock
#define RB_SLP_CLK_LED 0x40                         // RWA, close LED clock
#define RB_SLP_CLK_BLE 0x80                         // RWA, close BLE clock
#define R8_SLP_WAKE_CTRL (*((PUINT8V)0x4000100E))   // RWA, wake control, SAM
#define RB_SLP_USB_WAKE 0x01                        // RWA, enable USB waking
#define RB_SLP_ETH_WAKE 0x02                        // RWA, enable ETH waking
//#define  RB_SLP_BLE_WAKE    0x04                      // RWA, enable BLE waking
#define RB_SLP_RTC_WAKE 0x08                       // RWA, enable RTC waking
#define RB_SLP_GPIO_WAKE 0x10                      // RWA, enable GPIO waking
#define RB_SLP_BAT_WAKE 0x20                       // RWA, enable BAT waking
#define R8_SLP_POWER_CTRL (*((PUINT8V)0x4000100F)) // RWA, peripherals power down control, SAM
//#define  RB_SLP_USB_PWR_DN  0x01                      // RWA, enable USB power down
#define RB_SLP_ETH_PWR_DN 0x02 // RWA, enable ETH PHY power down
//#define  RB_SLP_BLE_PWR_DN  0x04                      // RWA, enable BLE power down
#define RB_SLP_ROM_PWR_DN 0x08 // RWA, enable Flash ROM power down during halt
#define RB_SLP_CLK_RAMX 0x10   // RWA, close main SRAM clock
#define RB_SLP_CLK_RAM2K 0x20  // RWA, close retention 2KB SRAM clock

/* System: I/O pin configuration register */
#define R32_PIN_CONFIG (*((PUINT32V)0x40001018))    // RW, I/O pin configuration
#define R16_PIN_ALTERNATE (*((PUINT16V)0x40001018)) // RW, function pin alternate configuration
#define RB_PIN_TMR0 0x01                            // RW, TMR0 alternate pin enable: 0=TMR0/PWM0/CAP0 on PA[3], 1=TMR0_/PWM0_/CAP0_ on PB[19]
#define RB_PIN_TMR1 0x02                            // RW, TMR1 alternate pin enable: 0=TMR1/PWM1/CAP1 on PA[10], 1=TMR1_/PWM1_/CAP1_ on PB[10]
#define RB_PIN_TMR2 0x04                            // RW, TMR2 alternate pin enable: 0=TMR2/PWM2/CAP2 on PA[11], 1=TMR2_/PWM2_/CAP2_ on PB[11]
#define RB_PIN_TMR3 0x08                            // RW, TMR3 alternate pin enable: 0=TMR3/PWM3/CAP3 on PA[2], 1=TMR3_/PWM3_/CAP3_ on PB[18]
#define RB_PIN_UART0 0x10                           // RW, RXD0/TXD0 alternate pin enable: 0=RXD0/TXD0 on PB[4]/PB[7], 1=RXD0_/TXD0_ on PA[15]/PA[14]
#define RB_PIN_UART1 0x20                           // RW, RXD1/TXD1 alternate pin enable: 0=RXD1/TXD1 on PA[8]/PA[9], 1=RXD1_/TXD1_ on PB[8]/PB[9]
#define RB_PIN_UART2 0x40                           // RW, RXD2/TXD2 alternate pin enable: 0=RXD2/TXD2 on PA[6]/PA[7], 1=RXD2_/TXD2_ on PB[22]/PB[23]
#define RB_PIN_UART3 0x80                           // RW, RXD3/TXD3 alternate pin enable: 0=RXD3/TXD3 on PA[4]/PA[5], 1=RXD3_/TXD3_ on PB[20]/PB[21]
#define RB_PIN_SPI0 0x100                           // RW, SCS/SCK0/MOSI/MISO alternate pin enable: 0=SCS/SCK0/MOSI/MISO on PA[12]/PA[13]/PA[14]/PA[15], 1=SCS_/SCK0_/MOSI_/MISO_ on PB[12]/PB[13]/PB[14]/PB[15]
#define R16_PIN_ANALOG_IE (*((PUINT16V)0x4000101A)) // RW, analog pin enable and digital input disable
#define RB_PIN_SEG0_3_IE 0x01                       // RW, LCD segment 0~3 digital input disable: 0=digital input enable, 1=digital input disable
#define RB_PIN_SEG4_7_IE 0x02                       // RW, LCD segment 4~7 digital input disable: 0=digital input enable, 1=digital input disable
#define RB_PIN_SEG8_11_IE 0x04                      // RW, LCD segment 8~11 digital input disable: 0=digital input enable, 1=digital input disable
#define RB_PIN_SEG12_15_IE 0x08                     // RW, LCD segment 12~15 digital input disable: 0=digital input enable, 1=digital input disable
#define RB_PIN_SEG16_19_IE 0x10                     // RW, LCD segment 16~19 digital input disable: 0=digital input enable, 1=digital input disable
#define RB_PIN_SEG20_23_IE 0x20                     // RW, LCD segment 20~23 digital input disable: 0=digital input enable, 1=digital input disable
#define RB_PIN_ETH_IE 0x40                          // RW, ETH analog I/O enable and digital input disable: 0=analog I/O disable and digital input enable, 1=analog I/O enable and digital input disable
#define RB_PIN_USB_IE 0x80                          // RW, USB analog I/O enable: 0=analog I/O disable, 1=analog I/O enable
#define RB_PIN_ADC8_9_IE 0x0100                     // RW, ADC/TouchKey channel 9/8 digital input disable: 0=digital input enable, 1=digital input disable
#define RB_PIN_ADC6_7_IE 0x0200                     // RW, ADC/TouchKey channel 7/6 digital input disable: 0=digital input enable, 1=digital input disable
#define RB_PIN_ADC0_1_IE 0x0400                     // RW, ADC/TouchKey channel 0/1 digital input disable: 0=digital input enable, 1=digital input disable
#define RB_PIN_ADC10_11_IE 0x0800                   // RW, ADC/TouchKey channel 10/11 digital input disable: 0=digital input enable, 1=digital input disable
#define RB_PIN_ADC12_13_IE 0x1000                   // RW, ADC/TouchKey channel 12/13 digital input disable: 0=digital input enable, 1=digital input disable
#define RB_PIN_XT32K_IE 0x2000                      // RW, external 32KHz oscillator digital input disable: 0=digital input enable, 1=digital input disable
#define RB_PIN_ADC2_3_IE 0x4000                     // RW, ADC/TouchKey channel 2/3 digital input disable: 0=digital input enable, 1=digital input disable
#define RB_PIN_ADC4_5_IE 0x8000                     // RW, ADC/TouchKey channel 4/5 digital input disable: 0=digital input enable, 1=digital input disable

/* System: parallel slave configuration register */
#define R32_PARA_SLV_CFG (*((PUINT32V)0x4000101C)) // RW, parallel slave configuration
#define R8_SLV_CONFIG (*((PUINT8V)0x4000101C))     // RW, parallel slave configuration
#define RB_SLV_ENABLE 0x01                         // RW, parallel slave enable
#define RB_SLV_IE_CMD 0x02                         // RW, enable interrupt for slave writing command event
#define RB_SLV_IE_WR 0x04                          // RW, enable interrupt for slave writing event
#define RB_SLV_IE_RD 0x08                          // RW, enable interrupt for slave reading event
#define RB_IF_SLV_CMD 0x20                         // RO, parallel slave command synchronous flag
#define RB_IF_SLV_WR 0x40                          // RW1, interrupt flag of parallel slave writing event
#define RB_IF_SLV_RD 0x80                          // RW1, interrupt flag of parallel slave reading event
#define R8_SLV_RD_DATA (*((PUINT8V)0x400010C8))    // RW, data for parallel slave read
#define R8_SLV_RD_STAT (*((PUINT8V)0x40001096))    // RW, status for parallel slave read
#define R8_SLV_WR_DATA (*((PUINT8V)0x40001097))    // RW, data or command from parallel slave write

/* System: power management register */
#define R32_POWER_MANAG (*((PUINT32V)0x40001020))  // RWA, power management register, SAM
#define R16_POWER_PLAN (*((PUINT16V)0x40001020))   // RWA, power plan before sleep instruction, SAM
#define RB_PWR_RAM2K 0x02                          // RWA, power for retention 2KB SRAM
#define RB_PWR_CORE 0x04                           // RWA, power retention for core and base peripherals
#define RB_PWR_EXTEND 0x08                         // RWA, power retention for USB and BLE
#define RB_PWR_RAM14K 0x10                         // RWA, power for main SRAM
#define RB_PWR_SYS_EN 0x80                         // RWA, power for system
#define RB_PWR_LDO_EN 0x0100                       // RWA, LDO enable
#define RB_PWR_DCDC_EN 0x0200                      // RWA, DC/DC converter enable: 0=DC/DC disable and bypass, 1=DC/DC enable
#define RB_PWR_DCDC_PRE 0x0400                     // RWA, DC/DC converter pre-enable
#define RB_PWR_PLAN_EN 0x8000                      // RWA/WZ, power plan enable, auto clear after sleep executed
#define RB_PWR_MUST_0010 0x1000                    // RWA, must write 0010
#define R16_AUX_POWER_ADJ (*((PUINT8V)0x40001022)) // RWA, aux power adjust control, SAM
#define RB_ULPLDO_ADJ 0x0007                       // RWA, Ultra-Low-Power LDO voltage adjust

/* System: battery detector register */
#define R32_BATTERY_CTRL (*((PUINT32V)0x40001024)) // RWA, battery voltage detector, SAM
#define R8_BAT_DET_CTRL (*((PUINT8V)0x40001024))   // RWA, battery voltage detector control, SAM
#define RB_BAT_DET_EN 0x01                         // RWA, battery voltage detector enable
#define RB_BAT_LOWER_IE 0x04                       // RWA, interrupt enable for battery lower voltage
#define RB_BAT_LOW_IE 0x08                         // RWA, interrupt enable for battery low voltage
// request NMI interrupt if both RB_BAT_LOWER_IE and RB_BAT_LOW_IE enabled
#define R8_BAT_DET_CFG (*((PUINT8V)0x40001025)) // RWA, battery voltage detector configuration, SAM
#define RB_BAT_LOW_VTH 0x03                     // RWA, select threshold voltage of battery voltage low
#define R8_BAT_STATUS (*((PUINT8V)0x40001026))  // RO, battery status
#define RB_BAT_STAT_LOWER 0x01                  // RO, battery lower voltage status, high action
#define RB_BAT_STAT_LOW 0x02                    // RO, battery low voltage status, high action

/* System: 32KHz oscillator control register */
#define R32_OSC32K_CTRL (*((PUINT32V)0x4000102C)) // RWA, 32KHz oscillator control, SAM
#define R16_INT32K_TUNE (*((PUINT16V)0x4000102C)) // RWA, internal 32KHz oscillator tune control, SAM
#define RB_INT32K_TUNE 0x03FF                     // RWA, internal 32KHz oscillator frequency tune
#define R8_XT32K_TUNE (*((PUINT8V)0x4000102E))    // RWA, external 32KHz oscillator tune control, SAM
#define RB_XT32K_I_TUNE 0x03                      // RWA, external 32KHz oscillator current tune: 00=75% current, 01=standard current, 10=150% current, 11=200% current
#define RB_XT32K_C_LOAD 0xF0                      // RWA, external 32KHz oscillator load capacitor tune: Cap = RB_XT32K_C_LOAD + 12pF
#define R8_CK32K_CONFIG (*((PUINT8V)0x4000102F))  // RWA, 32KHz oscillator configure
#define RB_CLK_XT32K_PON 0x01                     // RWA, external 32KHz oscillator power on
#define RB_CLK_INT32K_PON 0x02                    // RWA, internal 32KHz oscillator power on
#define RB_CLK_OSC32K_XT 0x04                     // RWA, 32KHz oscillator source selection: 0=RC, 1=XT
#define RB_32K_CLK_PIN 0x80                       // RO, 32KHz oscillator clock pin status

/* System: real-time clock register */
#define R32_RTC_CTRL (*((PUINT32V)0x40001030))    // RWA, RTC control, SAM
#define R8_RTC_FLAG_CTRL (*((PUINT8V)0x40001030)) // RW, RTC flag and clear control
#define RB_RTC_TMR_CLR 0x10                       // RW, set 1 to clear RTC timer action flag, auto clear
#define RB_RTC_TRIG_CLR 0x20                      // RW, set 1 to clear RTC trigger action flag, auto clear
#define RB_RTC_TMR_FLAG 0x40                      // RO, RTC timer action flag
#define RB_RTC_TRIG_FLAG 0x80                     // RO, RTC trigger action flag
#define R8_RTC_MODE_CTRL (*((PUINT8V)0x40001031)) // RWA, RTC mode control, SAM
#define RB_RTC_TMR_MODE 0x07                      // RWA, RTC timer mode: 000=0.125S, 001=0.25S, 010=0.5S, 011=1S, 100=2S, 101=4S, 110=8S, 111=16S
#define RB_RTC_IGNORE_B0 0x08                     // RWA, force ignore bit0 for trigger mode: 0=compare bit0, 1=ignore bit0
#define RB_RTC_TMR_EN 0x10                        // RWA, RTC timer mode enable
#define RB_RTC_TRIG_EN 0x20                       // RWA, RTC trigger mode enable
#define RB_RTC_LOAD_LO 0x40                       // RWA, set 1 to load RTC count low word R32_RTC_CNT_32K, auto clear after loaded
#define RB_RTC_LOAD_HI 0x80                       // RWA, set 1 to load RTC count high word R32_RTC_CNT_DAY, auto clear after loaded
#define R32_RTC_TRIG (*((PUINT32V)0x40001034))    // RWA, RTC trigger value, SAM
#define R32_RTC_CNT_32K (*((PUINT32V)0x40001038)) // RO, RTC count based 32KHz
#define R16_RTC_CNT_32K (*((PUINT16V)0x40001038)) // RO, RTC count based 32KHz
#define R16_RTC_CNT_2S (*((PUINT16V)0x4000103A))  // RO, RTC count based 2 second
#define R32_RTC_CNT_DAY (*((PUINT32V)0x4000103C)) // RO, RTC count based one day, only low 14 bit

