HaiMianBBao/PlumBL/PlumUSB/port/ch579/ch579_regs.h
/*System: Miscellaneous Control register */
#define R32_MISC_CTRL (*((PUINT32V)0x40001048)) // RWA, miscellaneous control register
#define R8_CFG_FLASH (*((PUINT8V)0x4000104A))   // RWA, Flash ROM configure register
#define RB_CFG_FLASH_X 0x0F                     // RWA, Flash ROM configure data, keep the value unchanged if write
#define RB_FLASH_BUSY_EN 0x80                   // RWA, enable ROM busy if burst reading: 1-enable(suggest), 0-disable
#define R8_PLL_CONFIG (*((PUINT8V)0x4000104B))  // RWA, PLL configuration control, SAM
#define RB_PLL_CFG_DAT 0x03                     // RWA, PLL configure data
#define RB_PLL_LOCKED 0x80                      // RO, indicate PLL locked

/* System: 32MHz oscillator control register */
#define R32_OSC32M_CTRL (*((PUINT32V)0x4000104C)) // RWA, 32MHz oscillator control, SAM
#define R8_INT32M_CALIB (*((PUINT8V)0x4000104C))  // RWA, internal 32MHz oscillator tune control, SAM
#define R8_XT32M_TUNE (*((PUINT8V)0x4000104E))    // RWA, external 32MHz oscillator tune control, SAM
#define RB_XT32M_I_BIAS 0x03                      // RWA, external 32MHz oscillator bias current tune: 00=75% current, 01=standard current, 10=125% current, 11=150% current
#define RB_XT32M_C_LOAD 0x70                      // RWA, external 32MHz oscillator load capacitor tune: Cap = RB_XT32M_C_LOAD * 2 + 10pF

/* System: oscillator frequency calibration register */
#define R32_OSC_CALIB (*((PUINT32V)0x40001050))   // RWA, oscillator frequency calibration, SAM
#define R16_OSC_CAL_CNT (*((PUINT16V)0x40001050)) // RO, system clock count value for 32KHz 5 cycles
#define RB_OSC_CAL_CNT 0x0FFF                     // RO, system clock count value for 32KHz 5 cycles
#define R8_OSC_CAL_CTRL (*((PUINT8V)0x40001052))  // RWA, oscillator frequency calibration control, SAM
#define RB_OSC_CNT_EN 0x01                        // RWA, calibration counter enable
#define RB_OSC_CNT_HALT 0x02                      // RO, calibration counter halt status: 0=counting, 1=halt for reading count value

/* System: ADC and Touch-key register */
#define R32_ADC_CTRL (*((PUINT32V)0x40001058))   // RW, ADC control
#define R8_ADC_CHANNEL (*((PUINT8V)0x40001058))  // RW, ADC input channel selection
#define RB_ADC_CH_INX 0x0F                       // RW, ADC input channel index
#define R8_ADC_CFG (*((PUINT8V)0x40001059))      // RW, ADC configure
#define RB_ADC_POWER_ON 0x01                     // RW, ADC power control: 0=power down, 1=power on
#define RB_ADC_BUF_EN 0x02                       // RW, ADC input buffer enable
#define RB_ADC_DIFF_EN 0x04                      // RW, ADC input channel mode: 0=single-end, 1=differnetial
#define RB_ADC_OFS_TEST 0x08                     // RW, enable ADC offset test mode: 0=normal mode, 1=short port4 to test offset
#define RB_ADC_PGA_GAIN 0x30                     // RW, set ADC input PGA gain: 00=-12dB, 01=-6dB, 10=0dB, 11=6dB
#define RB_ADC_CLK_DIV 0xC0                      // RW, select ADC clock frequency: 00=3.2MHz, 01=2.67MHz, 10=5.33MHz, 11=4MHz
#define R8_ADC_CONVERT (*((PUINT8V)0x4000105A))  // RW, ADC convert control
#define RB_ADC_START 0x01                        // RW, ADC convert start control: 0=stop ADC convert, 1=start an ADC convert, auto clear
#define RB_ADC_EOC_X 0x80                        // RO, end of ADC conversion flag
#define R8_TEM_SENSOR (*((PUINT8V)0x4000105B))   // RW, temperature sensor control
#define RB_TEM_SEN_CALIB 0x07                    // RW, temperature sensor calibration
#define RB_TEM_SEN_PWR_ON 0x80                   // RW, temperature sensor power control: 0=power down, 1=power on
#define R32_ADC_DATA (*((PUINT32V)0x4000105C))   // RO, ADC data and status
#define R16_ADC_DATA (*((PUINT16V)0x4000105C))   // RO, ADC data
#define RB_ADC_DATA 0x0FFF                       // RO, ADC conversion data
#define R8_ADC_INT_FLAG (*((PUINT8V)0x4000105E)) // RO, ADC interrupt flag register
#define RB_ADC_IF_EOC 0x80                       // RO, ADC conversion interrupt flag: 0=free or converting, 1=end of conversion, interrupt action, write R8_ADC_CONVERT to clear flag
#define R8_TKEY_CTRL (*((PUINT8V)0x4000105A))    // RW, Touchkey capacity charge and discharge status
#define RB_TKEY_PWR_ON 0x08                      // RW, Touchkey power on: 0=power down, 1=power on
#define RB_TKEY_ACTION 0x10                      // RO, Touchkey action status: 0=free, 1=discharge or charge or ADC
#define RB_TKEY_CHG_ACT 0x20                     // RO, Touchkey capacity charge status: 0=free, 1=charge
#define R8_TKEY_CNT (*((PUINT8V)0x4000105F))     // WO, Touch-key charge and discharge count

/* System: Flash ROM control register */
#define R32_FLASH_DATA (*((PUINT32V)0x40001800))   // RW, Flash ROM data
#define R32_FLASH_ADDR (*((PUINT32V)0x40001804))   // RW, Flash ROM address
#define R32_FLASH_CTRL (*((PUINT32V)0x40001808))   // RW, Flash ROM control and status
#define R8_FLASH_COMMAND (*((PUINT8V)0x40001808))  // WO, Flash ROM operation command
#define ROM_CMD_PROG 0x9A                          // WO: Flash ROM word program operation command, for changing some ROM bit of a word from 1 to 0
#define ROM_CMD_ERASE 0xA6                         // WO: Flash ROM sector erase operation command, for changing all ROM bit of 512Bytes from 0 to 1
#define R8_FLASH_PROTECT (*((PUINT8V)0x40001809))  // RW, Flash ROM protect control
#define RB_ROM_DATA_WE 0x04                        // RW, enable Flash ROM data area being erase/write: 0=writing protect, 1=enable program and erase
#define RB_ROM_CODE_WE 0x08                        // RW, enable Flash ROM code area being erase/write: 0=writing protect, 1=enable program and erase
#define RB_ROM_WE_MUST_10 0x80                     // RW, must write 10
#define R16_FLASH_STATUS (*((PUINT16V)0x4000180A)) // RO, Flash ROM operation status
#define R8_FLASH_STATUS (*((PUINT8V)0x4000180A))   // RO, Flash ROM operation status
#define RB_ROM_CMD_TOUT 0x01                       // RO, Flash ROM operation result: 0=success, 1=operation time out
#define RB_ROM_CMD_ERR 0x02                        // RO, Flash ROM operation command error flag: 0=command accepted, 1=unknown command
#define RB_ROM_ADDR_OK 0x40                        // RO, Flash ROM erase/write operation address valid flag, can be reviewed before or after operation: 0=invalid parameter, 1=address valid
#define RB_ROM_READ_FREE 0x100                     // RO, indicate protected status of Flash ROM code and data: 0=reading protect, 1=enable read by external programmer

/* System: GPIO interrupt control register */
#define R32_GPIO_INT_EN (*((PUINT32V)0x40001090))   // RW, GPIO interrupt enable
#define R16_PA_INT_EN (*((PUINT16V)0x40001090))     // RW, GPIO PA interrupt enable
#define R16_PB_INT_EN (*((PUINT16V)0x40001092))     // RW, GPIO PB interrupt enable
#define R32_GPIO_INT_MODE (*((PUINT32V)0x40001094)) // RW, GPIO interrupt mode: 0=level action, 1=edge action
#define R16_PA_INT_MODE (*((PUINT16V)0x40001094))   // RW, GPIO PA interrupt mode: 0=level action, 1=edge action
#define R16_PB_INT_MODE (*((PUINT16V)0x40001096))   // RW, GPIO PB interrupt mode: 0=level action, 1=edge action
#define R32_GPIO_INT_IF (*((PUINT32V)0x4000109C))   // RW1, GPIO interrupt flag
#define R16_PA_INT_IF (*((PUINT16V)0x4000109C))     // RW1, GPIO PA interrupt flag
#define R16_PB_INT_IF (*((PUINT16V)0x4000109E))     // RW1, GPIO PB interrupt flag

/* GPIO PA register */
#define R32_PA_DIR (*((PUINT32V)0x400010A0))    // RW, GPIO PA I/O direction: 0=in, 1=out
#define R8_PA_DIR_0 (*((PUINT8V)0x400010A0))    // RW, GPIO PA I/O direction byte 0
#define R8_PA_DIR_1 (*((PUINT8V)0x400010A1))    // RW, GPIO PA I/O direction byte 1
#define R32_PA_PIN (*((PUINT32V)0x400010A4))    // RO, GPIO PA input
#define R8_PA_PIN_0 (*((PUINT8V)0x400010A4))    // RO, GPIO PA input byte 0
#define R8_PA_PIN_1 (*((PUINT8V)0x400010A5))    // RO, GPIO PA input byte 1
#define R32_PA_OUT (*((PUINT32V)0x400010A8))    // RW, GPIO PA output
#define R8_PA_OUT_0 (*((PUINT8V)0x400010A8))    // RW, GPIO PA output byte 0
#define R8_PA_OUT_1 (*((PUINT8V)0x400010A9))    // RW, GPIO PA output byte 1
#define R32_PA_CLR (*((PUINT32V)0x400010AC))    // WZ, GPIO PA clear output: 0=keep, 1=clear
#define R8_PA_CLR_0 (*((PUINT8V)0x400010AC))    // WZ, GPIO PA clear output byte 0
#define R8_PA_CLR_1 (*((PUINT8V)0x400010AD))    // WZ, GPIO PA clear output byte 1
#define R32_PA_PU (*((PUINT32V)0x400010B0))     // RW, GPIO PA pullup resistance enable
#define R8_PA_PU_0 (*((PUINT8V)0x400010B0))     // RW, GPIO PA pullup resistance enable byte 0
#define R8_PA_PU_1 (*((PUINT8V)0x400010B1))     // RW, GPIO PA pullup resistance enable byte 1
#define R32_PA_PD_DRV (*((PUINT32V)0x400010B4)) // RW, PA pulldown for input or PA driving capability for output
#define R8_PA_PD_DRV_0 (*((PUINT8V)0x400010B4)) // RW, PA pulldown for input or PA driving capability for output byte 0
#define R8_PA_PD_DRV_1 (*((PUINT8V)0x400010B5)) // RW, PA pulldown for input or PA driving capability for output byte 1

/* GPIO PB register */
#define R32_PB_DIR (*((PUINT32V)0x400010C0))    // RW, GPIO PB I/O direction: 0=in, 1=out
#define R8_PB_DIR_0 (*((PUINT8V)0x400010C0))    // RW, GPIO PB I/O direction byte 0
#define R8_PB_DIR_1 (*((PUINT8V)0x400010C1))    // RW, GPIO PB I/O direction byte 1
#define R8_PB_DIR_2 (*((PUINT8V)0x400010C2))    // RW, GPIO PB I/O direction byte 2
#define R32_PB_PIN (*((PUINT32V)0x400010C4))    // RO, GPIO PB input
#define R8_PB_PIN_0 (*((PUINT8V)0x400010C4))    // RO, GPIO PB input byte 0
#define R8_PB_PIN_1 (*((PUINT8V)0x400010C5))    // RO, GPIO PB input byte 1
#define R8_PB_PIN_2 (*((PUINT8V)0x400010C6))    // RO, GPIO PB input byte 2
#define R32_PB_OUT (*((PUINT32V)0x400010C8))    // RW, GPIO PB output
#define R8_PB_OUT_0 (*((PUINT8V)0x400010C8))    // RW, GPIO PB output byte 0
#define R8_PB_OUT_1 (*((PUINT8V)0x400010C9))    // RW, GPIO PB output byte 1
#define R8_PB_OUT_2 (*((PUINT8V)0x400010CA))    // RW, GPIO PB output byte 2
#define R32_PB_CLR (*((PUINT32V)0x400010CC))    // WZ, GPIO PB clear output: 0=keep, 1=clear
#define R8_PB_CLR_0 (*((PUINT8V)0x400010CC))    // WZ, GPIO PB clear output byte 0
#define R8_PB_CLR_1 (*((PUINT8V)0x400010CD))    // WZ, GPIO PB clear output byte 1
#define R8_PB_CLR_2 (*((PUINT8V)0x400010CE))    // WZ, GPIO PB clear output byte 2
#define R32_PB_PU (*((PUINT32V)0x400010D0))     // RW, GPIO PB pullup resistance enable
#define R8_PB_PU_0 (*((PUINT8V)0x400010D0))     // RW, GPIO PB pullup resistance enable byte 0
#define R8_PB_PU_1 (*((PUINT8V)0x400010D1))     // RW, GPIO PB pullup resistance enable byte 1
#define R8_PB_PU_2 (*((PUINT8V)0x400010D2))     // RW, GPIO PB pullup resistance enable byte 2
#define R32_PB_PD_DRV (*((PUINT32V)0x400010D4)) // RW, PB pulldown for input or PB driving capability for output
#define R8_PB_PD_DRV_0 (*((PUINT8V)0x400010D4)) // RW, PB pulldown for input or PB driving capability for output byte 0
#define R8_PB_PD_DRV_1 (*((PUINT8V)0x400010D5)) // RW, PB pulldown for input or PB driving capability for output byte 1
#define R8_PB_PD_DRV_2 (*((PUINT8V)0x400010D6)) // RW, PB pulldown for input or PB driving capability for output byte 2

/* GPIO register address offset and bit define */
#define BA_PA ((PUINT8V)0x400010A0) // point GPIO PA base address
#define BA_PB ((PUINT8V)0x400010C0) // point GPIO PB base address
#define GPIO_DIR 0x00
#define GPIO_DIR_0 0x00
#define GPIO_DIR_1 0x01
#define GPIO_DIR_2 0x02
#define GPIO_PIN 0x04
#define GPIO_PIN_0 0x04
#define GPIO_PIN_1 0x05
#define GPIO_PIN_2 0x06
#define GPIO_OUT 0x08
#define GPIO_OUT_0 0x08
#define GPIO_OUT_1 0x09
#define GPIO_OUT_2 0x0A
#define GPIO_CLR 0x0C
#define GPIO_CLR_0 0x0C
#define GPIO_CLR_1 0x0D
#define GPIO_CLR_2 0x0E
#define GPIO_PU 0x10
#define GPIO_PU_0 0x10
#define GPIO_PU_1 0x11
#define GPIO_PU_2 0x12
#define GPIO_PD_DRV 0x14
#define GPIO_PD_DRV_0 0x14
#define GPIO_PD_DRV_1 0x15
#define GPIO_PD_DRV_2 0x16

/* GPIO alias name */
#define bSCK1 (1 << 0)  // PA0
#define bPADDR (1 << 0) // PA0
#define bLED0 (1 << 0)  // PA0
#define bCOM0 (1 << 0)  // PA0
#define bSDO (1 << 1)   // PA1
#define bMOSI1 bSDO
#define bPCS (1 << 1)  // PA1
#define bLED1 (1 << 1) // PA1
#define bCOM1 (1 << 1) // PA1
#define bTMR3 (1 << 2) // PA2
#define bCAP3 bTMR3
#define bPWM3 bTMR3
#define bSDI (1 << 2) // PA2
#define bMISO1 bSDI
#define bLED2 (1 << 2) // PA2
#define bCOM2 (1 << 2) // PA2
#define bTMR0 (1 << 3) // PA3
#define bCAP0 bTMR0
#define bPWM0 bTMR0
#define bPINT (1 << 3)   // PA3
#define bLED3 (1 << 3)   // PA3
#define bCOM3 (1 << 3)   // PA3
#define bUBUS1 (1 << 4)  // PA4
#define bAIN0 (1 << 4)   // PA4
#define bRXD3 (1 << 4)   // PA4
#define bLEDC (1 << 4)   // PA4
#define bUCC1 (1 << 5)   // PA5
#define bAIN1 (1 << 5)   // PA5
#define bTXD3 (1 << 5)   // PA5
#define bUCC2 (1 << 6)   // PA6
#define bAIN2 (1 << 6)   // PA6
#define bRXD2 (1 << 6)   // PA6
#define bPWM4 (1 << 6)   // PA6
#define bTIN3 (1 << 7)   // PA7
#define bTXD2 (1 << 7)   // PA7
#define bPWM5 (1 << 7)   // PA7
#define bTIN4 (1 << 8)   // PA8
#define bRXD1 (1 << 8)   // PA8
#define bTIN5 (1 << 9)   // PA9
#define bTXD1 (1 << 9)   // PA9
#define bX32KI (1 << 10) // PA10
#define bTMR1 (1 << 10)  // PA10
#define bCAP1 bTMR1
#define bPWM1 bTMR1
#define bX32KO (1 << 11) // PA11
#define bTMR2 (1 << 11)  // PA11
#define bCAP2 bTMR2
#define bPWM2 bTMR2
#define bTIN2 (1 << 12)   // PA12
#define bSCS (1 << 12)    // PA12
#define bTIN1 (1 << 13)   // PA13
#define bSCK0 (1 << 13)   // PA13
#define bUBUS2 (1 << 14)  // PA14
#define bAIN3 (1 << 14)   // PA14
#define bMOSI (1 << 14)   // PA14
#define bTXD0_ (1 << 14)  // PA14
#define bTIN0 (1 << 15)   // PA15
#define bMISO (1 << 15)   // PA15
#define bRXD0_ (1 << 15)  // PA15
#define bCTS (1 << 0)     // PB0
#define bPWM6 (1 << 0)    // PB0
#define bSEG0 (1 << 0)    // PB0
#define bDSR (1 << 1)     // PB1
#define bPWM7 (1 << 1)    // PB1
#define bSEG1 (1 << 1)    // PB1
#define bRI (1 << 2)      // PB2
#define bPWM8 (1 << 2)    // PB2
#define bSEG2 (1 << 2)    // PB2
#define bDCD (1 << 3)     // PB3
#define bPWM9 (1 << 3)    // PB3
#define bSEG3 (1 << 3)    // PB3
#define bRXD0 (1 << 4)    // PB4
#define bSEG4 (1 << 4)    // PB4
#define bDTR (1 << 5)     // PB5
#define bSEG5 (1 << 5)    // PB5
#define bRTS (1 << 6)     // PB6
#define bSEG6 (1 << 6)    // PB6
#define bTXD0 (1 << 7)    // PB7
#define bSEG7 (1 << 7)    // PB7
#define bPBUS (0xFF << 0) // PB0~PB7
#define bTIN8 (1 << 8)    // PB8
#define bRXD1_ (1 << 8)   // PB8
#define bPRD (1 << 8)     // PB8
#define bSEG8 (1 << 8)    // PB8
#define bTIN9 (1 << 9)    // PB9
#define bTXD1_ (1 << 9)   // PB9
#define bPWR (1 << 9)     // PB9
#define bSEG9 (1 << 9)    // PB9
#define bUDM (1 << 10)    // PB10
#define bTMR1_ (1 << 10)  // PB10
#define bCAP1_ bTMR1_
#define bPWM1_ bTMR1_
#define bSEG10 (1 << 10) // PB10
#define bUDP (1 << 11)   // PB11
#define bTMR2_ (1 << 11) // PB11
#define bCAP2_ bTMR2_
#define bPWM2_ bTMR2_
#define bSEG11 (1 << 11) // PB11
#define bETM (1 << 12)   // PB12
#define bSCS_ (1 << 12)  // PB12
#define bSEG12 (1 << 12) // PB12
#define bETP (1 << 13)   // PB13
#define bSCK0_ (1 << 13) // PB13
#define bSEG13 (1 << 13) // PB13
#define bERM (1 << 14)   // PB14
#define bMOSI_ (1 << 14) // PB14
#define bPWM10 (1 << 14) // PB14
#define bSEG14 (1 << 14) // PB14
#define bERP (1 << 15)   // PB15
#define bMISO_ (1 << 15) // PB15
#define bSEG15 (1 << 15) // PB15
#define bTIN6 (1 << 16)  // PB16
#define bTIO (1 << 16)   // PB16
#define bSEG16 (1 << 16) // PB16
#define bTIN7 (1 << 17)  // PB17
#define bTCK (1 << 17)   // PB17
#define bSEG17 (1 << 17) // PB17
#define bTMR3_ (1 << 18) // PB18
#define bCAP3_ bTMR3_
#define bPWM3_ bTMR3_
#define bSEG18 (1 << 18) // PB18
#define bTMR0_ (1 << 19) // PB19
#define bCAP0_ bTMR0_
#define bPWM0_ bTMR0_
#define bSEG19 (1 << 19) // PB19
#define bRXD3_ (1 << 20) // PB20
#define bSEG20 (1 << 20) // PB20
#define bTXD3_ (1 << 21) // PB21
#define bSEG21 (1 << 21) // PB21
#define bRXD2_ (1 << 22) // PB22
#define bSEG22 (1 << 22) // PB22
#define bRST (1 << 23)   // PB23
#define bTXD2_ (1 << 23) // PB23
#define bPWM11 (1 << 23) // PB23
#define bSEG23 (1 << 23) // PB23

/* Timer0 register */
#define R32_TMR0_CONTROL (*((PUINT32V)0x40002000))  // RW, TMR0 control
#define R8_TMR0_CTRL_MOD (*((PUINT8V)0x40002000))   // RW, TMR0 mode control
#define R8_TMR0_INTER_EN (*((PUINT8V)0x40002002))   // RW, TMR0 interrupt enable
#define R32_TMR0_STATUS (*((PUINT32V)0x40002004))   // RW, TMR0 status
#define R8_TMR0_INT_FLAG (*((PUINT8V)0x40002006))   // RW1, TMR0 interrupt flag
#define R8_TMR0_FIFO_COUNT (*((PUINT8V)0x40002007)) // RO, TMR0 FIFO count status
#define R32_TMR0_COUNT (*((PUINT32V)0x40002008))    // RO, TMR0 current count
#define R16_TMR0_COUNT (*((PUINT16V)0x40002008))    // RO, TMR0 current count
#define R8_TMR0_COUNT (*((PUINT8V)0x40002008))      // RO, TMR0 current count
#define R32_TMR0_CNT_END (*((PUINT32V)0x4000200C))  // RW, TMR0 end count value, only low 26 bit
#define R32_TMR0_FIFO (*((PUINT32V)0x40002010))     // RO/WO, TMR0 FIFO register, only low 26 bit
#define R16_TMR0_FIFO (*((PUINT16V)0x40002010))     // RO/WO, TMR0 FIFO register
#define R8_TMR0_FIFO (*((PUINT8V)0x40002010))       // RO/WO, TMR0 FIFO register

