HaiMianBBao/PlumBL/PlumUSB/port/ch579/ch579_regs.h
/* Timer1 register */
#define R32_TMR1_CONTROL (*((PUINT32V)0x40002400))  // RW, TMR1 control
#define R8_TMR1_CTRL_MOD (*((PUINT8V)0x40002400))   // RW, TMR1 mode control
#define R8_TMR1_CTRL_DMA (*((PUINT8V)0x40002401))   // RW, TMR1 DMA control
#define R8_TMR1_INTER_EN (*((PUINT8V)0x40002402))   // RW, TMR1 interrupt enable
#define R32_TMR1_STATUS (*((PUINT32V)0x40002404))   // RW, TMR1 status
#define R8_TMR1_INT_FLAG (*((PUINT8V)0x40002406))   // RW1, TMR1 interrupt flag
#define R8_TMR1_FIFO_COUNT (*((PUINT8V)0x40002407)) // RO, TMR1 FIFO count status
#define R32_TMR1_COUNT (*((PUINT32V)0x40002408))    // RO, TMR1 current count
#define R16_TMR1_COUNT (*((PUINT16V)0x40002408))    // RO, TMR1 current count
#define R8_TMR1_COUNT (*((PUINT8V)0x40002408))      // RO, TMR1 current count
#define R32_TMR1_CNT_END (*((PUINT32V)0x4000240C))  // RW, TMR1 end count value, only low 26 bit
#define R32_TMR1_FIFO (*((PUINT32V)0x40002410))     // RO/WO, TMR1 FIFO register, only low 26 bit
#define R16_TMR1_FIFO (*((PUINT16V)0x40002410))     // RO/WO, TMR1 FIFO register
#define R8_TMR1_FIFO (*((PUINT8V)0x40002410))       // RO/WO, TMR1 FIFO register
#define R32_TMR1_DMA_NOW (*((PUINT32V)0x40002414))  // RW, TMR1 DMA current address
#define R16_TMR1_DMA_NOW (*((PUINT16V)0x40002414))  // RW, TMR1 DMA current address
#define R32_TMR1_DMA_BEG (*((PUINT32V)0x40002418))  // RW, TMR1 DMA begin address
#define R16_TMR1_DMA_BEG (*((PUINT16V)0x40002418))  // RW, TMR1 DMA begin address
#define R32_TMR1_DMA_END (*((PUINT32V)0x4000241C))  // RW, TMR1 DMA end address
#define R16_TMR1_DMA_END (*((PUINT16V)0x4000241C))  // RW, TMR1 DMA end address

/* Timer2 register */
#define R32_TMR2_CONTROL (*((PUINT32V)0x40002800))  // RW, TMR2 control
#define R8_TMR2_CTRL_MOD (*((PUINT8V)0x40002800))   // RW, TMR2 mode control
#define R8_TMR2_CTRL_DMA (*((PUINT8V)0x40002801))   // RW, TMR2 DMA control
#define R8_TMR2_INTER_EN (*((PUINT8V)0x40002802))   // RW, TMR2 interrupt enable
#define R32_TMR2_STATUS (*((PUINT32V)0x40002804))   // RW, TMR2 status
#define R8_TMR2_INT_FLAG (*((PUINT8V)0x40002806))   // RW1, TMR2 interrupt flag
#define R8_TMR2_FIFO_COUNT (*((PUINT8V)0x40002807)) // RO, TMR2 FIFO count status
#define R32_TMR2_COUNT (*((PUINT32V)0x40002808))    // RO, TMR2 current count
#define R16_TMR2_COUNT (*((PUINT16V)0x40002808))    // RO, TMR2 current count
#define R8_TMR2_COUNT (*((PUINT8V)0x40002808))      // RO, TMR2 current count
#define R32_TMR2_CNT_END (*((PUINT32V)0x4000280C))  // RW, TMR2 end count value, only low 26 bit
#define R32_TMR2_FIFO (*((PUINT32V)0x40002810))     // RO/WO, TMR2 FIFO register, only low 26 bit
#define R16_TMR2_FIFO (*((PUINT16V)0x40002810))     // RO/WO, TMR2 FIFO register
#define R8_TMR2_FIFO (*((PUINT8V)0x40002810))       // RO/WO, TMR2 FIFO register
#define R32_TMR2_DMA_NOW (*((PUINT32V)0x40002814))  // RW, TMR2 DMA current address
#define R16_TMR2_DMA_NOW (*((PUINT16V)0x40002814))  // RW, TMR2 DMA current address
#define R32_TMR2_DMA_BEG (*((PUINT32V)0x40002818))  // RW, TMR2 DMA begin address
#define R16_TMR2_DMA_BEG (*((PUINT16V)0x40002818))  // RW, TMR2 DMA begin address
#define R32_TMR2_DMA_END (*((PUINT32V)0x4000281C))  // RW, TMR2 DMA end address
#define R16_TMR2_DMA_END (*((PUINT16V)0x4000281C))  // RW, TMR2 DMA end address

/* Timer3 register */
#define R32_TMR3_CONTROL (*((PUINT32V)0x40002C00))  // RW, TMR3 control
#define R8_TMR3_CTRL_MOD (*((PUINT8V)0x40002C00))   // RW, TMR3 mode control
#define R8_TMR3_INTER_EN (*((PUINT8V)0x40002C02))   // RW, TMR3 interrupt enable
#define R32_TMR3_STATUS (*((PUINT32V)0x40002C04))   // RW, TMR3 status
#define R8_TMR3_INT_FLAG (*((PUINT8V)0x40002C06))   // RW1, TMR3 interrupt flag
#define R8_TMR3_FIFO_COUNT (*((PUINT8V)0x40002C07)) // RO, TMR3 FIFO count status
#define R32_TMR3_COUNT (*((PUINT32V)0x40002C08))    // RO, TMR3 current count
#define R16_TMR3_COUNT (*((PUINT16V)0x40002C08))    // RO, TMR3 current count
#define R8_TMR3_COUNT (*((PUINT8V)0x40002C08))      // RO, TMR3 current count
#define R32_TMR3_CNT_END (*((PUINT32V)0x40002C0C))  // RW, TMR3 end count value, only low 26 bit
#define R32_TMR3_FIFO (*((PUINT32V)0x40002C10))     // RO/WO, TMR3 FIFO register, only low 26 bit
#define R16_TMR3_FIFO (*((PUINT16V)0x40002C10))     // RO/WO, TMR3 FIFO register
#define R8_TMR3_FIFO (*((PUINT8V)0x40002C10))       // RO/WO, TMR3 FIFO register

/* Timer register address offset and bit define */
#define TMR_FIFO_SIZE 8               // timer FIFO size (depth)
#define BA_TMR0 ((PUINT8V)0x40002000) // point TMR0 base address
#define BA_TMR1 ((PUINT8V)0x40002400) // point TMR1 base address
#define BA_TMR2 ((PUINT8V)0x40002800) // point TMR2 base address
#define BA_TMR3 ((PUINT8V)0x40002C00) // point TMR3 base address
#define TMR_CTRL_MOD 0
#define RB_TMR_MODE_IN 0x01    // RW, timer in mode: 0=timer/PWM, 1=capture/count
#define RB_TMR_ALL_CLEAR 0x02  // RW, force clear timer FIFO and count
#define RB_TMR_COUNT_EN 0x04   // RW, timer count enable
#define RB_TMR_OUT_EN 0x08     // RW, timer output enable
#define RB_TMR_OUT_POLAR 0x10  // RW, timer PWM output polarity: 0=default low and high action, 1=default high and low action
#define RB_TMR_CAP_COUNT 0x10  // RW, count sub-mode if RB_TMR_MODE_IN=1: 0=capture, 1=count
#define RB_TMR_PWM_REPEAT 0xC0 // RW, timer PWM repeat mode: 00=1, 01=4, 10=8, 11-16
#define RB_TMR_CAP_EDGE 0xC0   // RW, timer capture edge mode: 00=disable, 01=edge change, 10=fall to fall, 11-rise to rise
#define TMR_CTRL_DMA 1
#define RB_TMR_DMA_ENABLE 0x01 // RW, timer1/2 DMA enable
#define RB_TMR_DMA_LOOP 0x04   // RW, timer1/2 DMA address loop enable
#define TMR_INTER_EN 2
#define RB_TMR_IE_CYC_END 0x01  // RW, enable interrupt for timer capture count timeout or PWM cycle end
#define RB_TMR_IE_DATA_ACT 0x02 // RW, enable interrupt for timer capture input action or PWM trigger
#define RB_TMR_IE_FIFO_HF 0x04  // RW, enable interrupt for timer FIFO half (capture fifo >=4 or PWM fifo <=3)
#define RB_TMR_IE_DMA_END 0x08  // RW, enable interrupt for timer1/2 DMA completion
#define RB_TMR_IE_FIFO_OV 0x10  // RW, enable interrupt for timer FIFO overflow
#define TMR_INT_FLAG 6
#define RB_TMR_IF_CYC_END 0x01  // RW1, interrupt flag for timer capture count timeout or PWM cycle end
#define RB_TMR_IF_DATA_ACT 0x02 // RW1, interrupt flag for timer capture input action or PWM trigger
#define RB_TMR_IF_FIFO_HF 0x04  // RW1, interrupt flag for timer FIFO half (capture fifo >=4 or PWM fifo <=3)
#define RB_TMR_IF_DMA_END 0x08  // RW1, interrupt flag for timer1/2 DMA completion
#define RB_TMR_IF_FIFO_OV 0x10  // RW1, interrupt flag for timer FIFO overflow
#define TMR_FIFO_COUNT 7
#define TMR_COUNT 0x08
#define TMR_CNT_END 0x0C
#define TMR_FIFO 0x10
#define TMR_DMA_NOW 0x14
#define TMR_DMA_BEG 0x18
#define TMR_DMA_END 0x1C

/* UART0 register */
#define R32_UART0_CTRL (*((PUINT32V)0x40003000))  // RW, UART0 control
#define R8_UART0_MCR (*((PUINT8V)0x40003000))     // RW, UART0 modem control
#define R8_UART0_IER (*((PUINT8V)0x40003001))     // RW, UART0 interrupt enable
#define R8_UART0_FCR (*((PUINT8V)0x40003002))     // RW, UART0 FIFO control
#define R8_UART0_LCR (*((PUINT8V)0x40003003))     // RW, UART0 line control
#define R32_UART0_STAT (*((PUINT32V)0x40003004))  // RO, UART0 status
#define R8_UART0_IIR (*((PUINT8V)0x40003004))     // RO, UART0 interrupt identification
#define R8_UART0_LSR (*((PUINT8V)0x40003005))     // RO, UART0 line status
#define R8_UART0_MSR (*((PUINT8V)0x40003006))     // RO, UART0 modem status
#define R32_UART0_FIFO (*((PUINT32V)0x40003008))  // RW, UART0 data or FIFO port
#define R8_UART0_RBR (*((PUINT8V)0x40003008))     // RO, UART0 receiver buffer, receiving byte
#define R8_UART0_THR (*((PUINT8V)0x40003008))     // WO, UART0 transmitter holding, transmittal byte
#define R8_UART0_RFC (*((PUINT8V)0x4000300A))     // RO, UART0 receiver FIFO count
#define R8_UART0_TFC (*((PUINT8V)0x4000300B))     // RO, UART0 transmitter FIFO count
#define R32_UART0_SETUP (*((PUINT32V)0x4000300C)) // RW, UART0 setup
#define R16_UART0_DL (*((PUINT16V)0x4000300C))    // RW, UART0 divisor latch
#define R8_UART0_DLL (*((PUINT8V)0x4000300C))     // RW, UART0 divisor latch LSB byte
#define R8_UART0_DLM (*((PUINT8V)0x4000300D))     // RW, UART0 divisor latch MSB byte
#define R8_UART0_DIV (*((PUINT8V)0x4000300E))     // RW, UART0 pre-divisor latch byte, only low 7 bit, from 1 to 0/128
#define R8_UART0_ADR (*((PUINT8V)0x4000300F))     // RW, UART0 slave address: 0xFF=disable, other=enable

/* UART1 register */
#define R32_UART1_CTRL (*((PUINT32V)0x40003400))  // RW, UART1 control
#define R8_UART1_MCR (*((PUINT8V)0x40003400))     // RW, UART1 modem control
#define R8_UART1_IER (*((PUINT8V)0x40003401))     // RW, UART1 interrupt enable
#define R8_UART1_FCR (*((PUINT8V)0x40003402))     // RW, UART1 FIFO control
#define R8_UART1_LCR (*((PUINT8V)0x40003403))     // RW, UART1 line control
#define R32_UART1_STAT (*((PUINT32V)0x40003404))  // RO, UART1 status
#define R8_UART1_IIR (*((PUINT8V)0x40003404))     // RO, UART1 interrupt identification
#define R8_UART1_LSR (*((PUINT8V)0x40003405))     // RO, UART1 line status
#define R32_UART1_FIFO (*((PUINT32V)0x40003408))  // RW, UART1 data or FIFO port
#define R8_UART1_RBR (*((PUINT8V)0x40003408))     // RO, UART1 receiver buffer, receiving byte
#define R8_UART1_THR (*((PUINT8V)0x40003408))     // WO, UART1 transmitter holding, transmittal byte
#define R8_UART1_RFC (*((PUINT8V)0x4000340A))     // RO, UART1 receiver FIFO count
#define R8_UART1_TFC (*((PUINT8V)0x4000340B))     // RO, UART1 transmitter FIFO count
#define R32_UART1_SETUP (*((PUINT32V)0x4000340C)) // RW, UART1 setup
#define R16_UART1_DL (*((PUINT16V)0x4000340C))    // RW, UART1 divisor latch
#define R8_UART1_DLL (*((PUINT8V)0x4000340C))     // RW, UART1 divisor latch LSB byte
#define R8_UART1_DLM (*((PUINT8V)0x4000340D))     // RW, UART1 divisor latch MSB byte
#define R8_UART1_DIV (*((PUINT8V)0x4000340E))     // RW, UART1 pre-divisor latch byte, only low 7 bit, from 1 to 0/128

/* UART2 register */
#define R32_UART2_CTRL (*((PUINT32V)0x40003800))  // RW, UART2 control
#define R8_UART2_MCR (*((PUINT8V)0x40003800))     // RW, UART2 modem control
#define R8_UART2_IER (*((PUINT8V)0x40003801))     // RW, UART2 interrupt enable
#define R8_UART2_FCR (*((PUINT8V)0x40003802))     // RW, UART2 FIFO control
#define R8_UART2_LCR (*((PUINT8V)0x40003803))     // RW, UART2 line control
#define R32_UART2_STAT (*((PUINT32V)0x40003804))  // RO, UART2 status
#define R8_UART2_IIR (*((PUINT8V)0x40003804))     // RO, UART2 interrupt identification
#define R8_UART2_LSR (*((PUINT8V)0x40003805))     // RO, UART2 line status
#define R32_UART2_FIFO (*((PUINT32V)0x40003808))  // RW, UART2 data or FIFO port
#define R8_UART2_RBR (*((PUINT8V)0x40003808))     // RO, UART2 receiver buffer, receiving byte
#define R8_UART2_THR (*((PUINT8V)0x40003808))     // WO, UART2 transmitter holding, transmittal byte
#define R8_UART2_RFC (*((PUINT8V)0x4000380A))     // RO, UART2 receiver FIFO count
#define R8_UART2_TFC (*((PUINT8V)0x4000380B))     // RO, UART2 transmitter FIFO count
#define R32_UART2_SETUP (*((PUINT32V)0x4000380C)) // RW, UART2 setup
#define R16_UART2_DL (*((PUINT16V)0x4000380C))    // RW, UART2 divisor latch
#define R8_UART2_DLL (*((PUINT8V)0x4000380C))     // RW, UART2 divisor latch LSB byte
#define R8_UART2_DLM (*((PUINT8V)0x4000380D))     // RW, UART2 divisor latch MSB byte
#define R8_UART2_DIV (*((PUINT8V)0x4000380E))     // RW, UART2 pre-divisor latch byte, only low 7 bit, from 1 to 0/128

