HaiMianBBao/PlumBL/PlumUSB/port/ch579/ch579_regs.h
/* UART3 register */
#define R32_UART3_CTRL (*((PUINT32V)0x40003C00))  // RW, UART3 control
#define R8_UART3_MCR (*((PUINT8V)0x40003C00))     // RW, UART3 modem control
#define R8_UART3_IER (*((PUINT8V)0x40003C01))     // RW, UART3 interrupt enable
#define R8_UART3_FCR (*((PUINT8V)0x40003C02))     // RW, UART3 FIFO control
#define R8_UART3_LCR (*((PUINT8V)0x40003C03))     // RW, UART3 line control
#define R32_UART3_STAT (*((PUINT32V)0x40003C04))  // RO, UART3 status
#define R8_UART3_IIR (*((PUINT8V)0x40003C04))     // RO, UART3 interrupt identification
#define R8_UART3_LSR (*((PUINT8V)0x40003C05))     // RO, UART3 line status
#define R32_UART3_FIFO (*((PUINT32V)0x40003C08))  // RW, UART3 data or FIFO port
#define R8_UART3_RBR (*((PUINT8V)0x40003C08))     // RO, UART3 receiver buffer, receiving byte
#define R8_UART3_THR (*((PUINT8V)0x40003C08))     // WO, UART3 transmitter holding, transmittal byte
#define R8_UART3_RFC (*((PUINT8V)0x40003C0A))     // RO, UART3 receiver FIFO count
#define R8_UART3_TFC (*((PUINT8V)0x40003C0B))     // RO, UART3 transmitter FIFO count
#define R32_UART3_SETUP (*((PUINT32V)0x40003C0C)) // RW, UART3 setup
#define R16_UART3_DL (*((PUINT16V)0x40003C0C))    // RW, UART3 divisor latch
#define R8_UART3_DLL (*((PUINT8V)0x40003C0C))     // RW, UART3 divisor latch LSB byte
#define R8_UART3_DLM (*((PUINT8V)0x40003C0D))     // RW, UART3 divisor latch MSB byte
#define R8_UART3_DIV (*((PUINT8V)0x40003C0E))     // RW, UART3 pre-divisor latch byte, only low 7 bit, from 1 to 0/128

/* UART register address offset and bit define */
#define UART_FIFO_SIZE 8               // UART FIFO size (depth)
#define UART_RECV_RDY_SZ 7             // the max FIFO trigger level for UART receiver data available
#define BA_UART0 ((PUINT8V)0x40003000) // point UART0 base address
#define BA_UART1 ((PUINT8V)0x40003400) // point UART1 base address
#define BA_UART2 ((PUINT8V)0x40003800) // point UART2 base address
#define BA_UART3 ((PUINT8V)0x40003C00) // point UART3 base address
#define UART_MCR 0
#define RB_MCR_DTR 0x01        // RW, UART0 control DTR
#define RB_MCR_RTS 0x02        // RW, UART0 control RTS
#define RB_MCR_OUT1 0x04       // RW, UART0 control OUT1
#define RB_MCR_OUT2 0x08       // RW, UART control OUT2
#define RB_MCR_INT_OE 0x08     // RW, UART interrupt output enable
#define RB_MCR_LOOP 0x10       // RW, UART0 enable local loop back
#define RB_MCR_AU_FLOW_EN 0x20 // RW, UART0 enable autoflow control
#define RB_MCR_TNOW 0x40       // RW, UART0 enable TNOW output on DTR pin
#define RB_MCR_HALF 0x80       // RW, UART0 enable half-duplex
#define UART_IER 1
#define RB_IER_RECV_RDY 0x01  // RW, UART interrupt enable for receiver data ready
#define RB_IER_THR_EMPTY 0x02 // RW, UART interrupt enable for THR empty
#define RB_IER_LINE_STAT 0x04 // RW, UART interrupt enable for receiver line status
#define RB_IER_MODEM_CHG 0x08 // RW, UART0 interrupt enable for modem status change
#define RB_IER_DTR_EN 0x10    // RW, UART0 DTR/TNOW output pin enable
#define RB_IER_RTS_EN 0x20    // RW, UART0 RTS output pin enable
#define RB_IER_TXD_EN 0x40    // RW, UART TXD pin enable
#define RB_IER_RESET 0x80     // WZ, UART software reset control, high action, auto clear
#define UART_FCR 2
#define RB_FCR_FIFO_EN 0x01     // RW, UART FIFO enable
#define RB_FCR_RX_FIFO_CLR 0x02 // WZ, clear UART receiver FIFO, high action, auto clear
#define RB_FCR_TX_FIFO_CLR 0x04 // WZ, clear UART transmitter FIFO, high action, auto clear
#define RB_FCR_FIFO_TRIG 0xC0   // RW, UART receiver FIFO trigger level: 00-1byte, 01-2bytes, 10-4bytes, 11-7bytes
#define UART_LCR 3
#define RB_LCR_WORD_SZ 0x03  // RW, UART word bit length: 00-5bit, 01-6bit, 10-7bit, 11-8bit
#define RB_LCR_STOP_BIT 0x04 // RW, UART stop bit length: 0-1bit, 1-2bit
#define RB_LCR_PAR_EN 0x08   // RW, UART parity enable
#define RB_LCR_PAR_MOD 0x30  // RW, UART parity mode: 00-odd, 01-even, 10-mark, 11-space
#define RB_LCR_BREAK_EN 0x40 // RW, UART break control enable
#define RB_LCR_DLAB 0x80     // RW, UART reserved bit
#define RB_LCR_GP_BIT 0x80   // RW, UART general purpose bit
#define UART_IIR 4
#define RB_IIR_NO_INT 0x01   // RO, UART no interrupt flag: 0=interrupt action, 1=no interrupt
#define RB_IIR_INT_MASK 0x0F // RO, UART interrupt flag bit mask
#define RB_IIR_FIFO_ID 0xC0  // RO, UART FIFO enabled flag
#define UART_LSR 5
#define RB_LSR_DATA_RDY 0x01    // RO, UART receiver fifo data ready status
#define RB_LSR_OVER_ERR 0x02    // RZ, UART receiver overrun error
#define RB_LSR_PAR_ERR 0x04     // RZ, UART receiver parity error
#define RB_LSR_FRAME_ERR 0x08   // RZ, UART receiver frame error
#define RB_LSR_BREAK_ERR 0x10   // RZ, UART receiver break error
#define RB_LSR_TX_FIFO_EMP 0x20 // RO, UART transmitter fifo empty status
#define RB_LSR_TX_ALL_EMP 0x40  // RO, UART transmitter all empty status
#define RB_LSR_ERR_RX_FIFO 0x80 // RO, indicate error in UART receiver fifo
#define UART_MSR 6
#define RB_MSR_CTS_CHG 0x01 // RZ, UART0 CTS changed status, high action
#define RB_MSR_DSR_CHG 0x02 // RZ, UART0 DSR changed status, high action
#define RB_MSR_RI_CHG 0x04  // RZ, UART0 RI changed status, high action
#define RB_MSR_DCD_CHG 0x08 // RZ, UART0 DCD changed status, high action
#define RB_MSR_CTS 0x10     // RO, UART0 CTS action status
#define RB_MSR_DSR 0x20     // RO, UART0 DSR action status
#define RB_MSR_RI 0x40      // RO, UART0 RI action status
#define RB_MSR_DCD 0x80     // RO, UART0 DCD action status
#define UART_RBR 8
#define UART_THR 8
#define UART_RFC 0x0A
#define UART_TFC 0x0B
#define UART_DLL 0x0C
#define UART_DLM 0x0D
#define UART_DIV 0x0E
#define UART_ADR 0x0F

/* UART interrupt identification values for IIR bits 3:0 */
#define UART_II_SLV_ADDR 0x0E  // RO, UART0 slave address match
#define UART_II_LINE_STAT 0x06 // RO, UART interrupt by receiver line status
#define UART_II_RECV_RDY 0x04  // RO, UART interrupt by receiver data available
#define UART_II_RECV_TOUT 0x0C // RO, UART interrupt by receiver fifo timeout
#define UART_II_THR_EMPTY 0x02 // RO, UART interrupt by THR empty
#define UART_II_MODEM_CHG 0x00 // RO, UART0 interrupt by modem status change
#define UART_II_NO_INTER 0x01  // RO, no UART interrupt is pending

/* SPI0 register */
#define R32_SPI0_CONTROL (*((PUINT32V)0x40004000))   // RW, SPI0 control
#define R8_SPI0_CTRL_MOD (*((PUINT8V)0x40004000))    // RW, SPI0 mode control
#define R8_SPI0_CTRL_CFG (*((PUINT8V)0x40004001))    // RW, SPI0 configuration control
#define R8_SPI0_INTER_EN (*((PUINT8V)0x40004002))    // RW, SPI0 interrupt enable
#define R8_SPI0_CLOCK_DIV (*((PUINT8V)0x40004003))   // RW, SPI0 master clock divisor
#define R8_SPI0_SLAVE_PRE (*((PUINT8V)0x40004003))   // RW, SPI0 slave preset value
#define R32_SPI0_STATUS (*((PUINT32V)0x40004004))    // RW, SPI0 status
#define R8_SPI0_BUFFER (*((PUINT8V)0x40004004))      // RO, SPI0 data buffer
#define R8_SPI0_RUN_FLAG (*((PUINT8V)0x40004005))    // RO, SPI0 work flag
#define R8_SPI0_INT_FLAG (*((PUINT8V)0x40004006))    // RW1, SPI0 interrupt flag
#define R8_SPI0_FIFO_COUNT (*((PUINT8V)0x40004007))  // RO, SPI0 FIFO count status
#define R32_SPI0_TOTAL_CNT (*((PUINT32V)0x4000400C)) // RW, SPI0 total byte count, only low 12 bit
#define R16_SPI0_TOTAL_CNT (*((PUINT16V)0x4000400C)) // RW, SPI0 total byte count, only low 12 bit
#define R32_SPI0_FIFO (*((PUINT32V)0x40004010))      // RW, SPI0 FIFO register
#define R8_SPI0_FIFO (*((PUINT8V)0x40004010))        // RO/WO, SPI0 FIFO register
#define R8_SPI0_FIFO_COUNT1 (*((PUINT8V)0x40004013)) // RO, SPI0 FIFO count status
#define R32_SPI0_DMA_NOW (*((PUINT32V)0x40004014))   // RW, SPI0 DMA current address
#define R16_SPI0_DMA_NOW (*((PUINT16V)0x40004014))   // RW, SPI0 DMA current address
#define R32_SPI0_DMA_BEG (*((PUINT32V)0x40004018))   // RW, SPI0 DMA begin address
#define R16_SPI0_DMA_BEG (*((PUINT16V)0x40004018))   // RW, SPI0 DMA begin address
#define R32_SPI0_DMA_END (*((PUINT32V)0x4000401C))   // RW, SPI0 DMA end address
#define R16_SPI0_DMA_END (*((PUINT16V)0x4000401C))   // RW, SPI0 DMA end address

/* SPI1 register */
#define R32_SPI1_CONTROL (*((PUINT32V)0x40004400))   // RW, SPI1 control
#define R8_SPI1_CTRL_MOD (*((PUINT8V)0x40004400))    // RW, SPI1 mode control
#define R8_SPI1_CTRL_CFG (*((PUINT8V)0x40004401))    // RW, SPI1 configuration control
#define R8_SPI1_INTER_EN (*((PUINT8V)0x40004402))    // RW, SPI1 interrupt enable
#define R8_SPI1_CLOCK_DIV (*((PUINT8V)0x40004403))   // RW, SPI1 master clock divisor
#define R32_SPI1_STATUS (*((PUINT32V)0x40004404))    // RW, SPI1 status
#define R8_SPI1_BUFFER (*((PUINT8V)0x40004404))      // RO, SPI1 data buffer
#define R8_SPI1_RUN_FLAG (*((PUINT8V)0x40004405))    // RO, SPI1 work flag
#define R8_SPI1_INT_FLAG (*((PUINT8V)0x40004406))    // RW1, SPI1 interrupt flag
#define R8_SPI1_FIFO_COUNT (*((PUINT8V)0x40004407))  // RO, SPI1 FIFO count status
#define R32_SPI1_TOTAL_CNT (*((PUINT32V)0x4000440C)) // RW, SPI1 total byte count, only low 12 bit
#define R16_SPI1_TOTAL_CNT (*((PUINT16V)0x4000440C)) // RW, SPI1 total byte count, only low 12 bit
#define R32_SPI1_FIFO (*((PUINT32V)0x40004410))      // RW, SPI1 FIFO register
#define R8_SPI1_FIFO (*((PUINT8V)0x40004410))        // RO/WO, SPI1 FIFO register
#define R8_SPI1_FIFO_COUNT1 (*((PUINT8V)0x40004413)) // RO, SPI1 FIFO count status

/* SPI register address offset and bit define */
#define SPI_FIFO_SIZE 8               // SPI FIFO size (depth)
#define BA_SPI0 ((PUINT8V)0x40004000) // point SPI0 base address
#define BA_SPI1 ((PUINT8V)0x40004400) // point SPI1 base address
#define SPI_CTRL_MOD 0
#define RB_SPI_MODE_SLAVE 0x01  // RW, SPI0 slave mode: 0=master/host, 1=slave/device
#define RB_SPI_ALL_CLEAR 0x02   // RW, force clear SPI FIFO and count
#define RB_SPI_2WIRE_MOD 0x04   // RW, SPI0 enable 2 wire mode for slave: 0=3wire(SCK0,MOSI,MISO), 1=2wire(SCK0,MISO=MXSX)
#define RB_SPI_MST_SCK_MOD 0x08 // RW, SPI master clock mode: 0=mode 0, 1=mode 3
#define RB_SPI_SLV_CMD_MOD 0x08 // RW, SPI0 slave command mode: 0=byte stream, 1=first byte command
#define RB_SPI_FIFO_DIR 0x10    // RW, SPI FIFO direction: 0=out(write @master mode), 1=in(read @master mode)
#define RB_SPI_SCK_OE 0x20      // RW, SPI SCK output enable
#define RB_SPI_MOSI_OE 0x40     // RW, SPI MOSI output enable
#define RB_SPI1_SDO_OE 0x40     // RW, SPI1 SDO output enable
#define RB_SPI_MISO_OE 0x80     // RW, SPI MISO output enable
#define RB_SPI1_SDI_OE 0x80     // RW, SPI1 SDI output enable, SPI1 enable 2 wire mode: 0=3wire(SCK1,SDO,SDI), 1=2wire(SCK1,SDI=SDX)
#define SPI_CTRL_CFG 1
#define RB_SPI_DMA_ENABLE 0x01 // RW, SPI0 DMA enable
#define RB_SPI_DMA_LOOP 0x04   // RW, SPI0 DMA address loop enable
#define RB_SPI_AUTO_IF 0x10    // RW, enable buffer/FIFO accessing to auto clear RB_SPI_IF_BYTE_END interrupt flag
#define RB_SPI_BIT_ORDER 0x20  // RW, SPI bit data order: 0=MSB first, 1=LSB first
#define RB_SPI_MST_DLY_EN 0x40 // RW, SPI master input delay enable
#define SPI_INTER_EN 2
#define RB_SPI_IE_CNT_END 0x01  // RW, enable interrupt for SPI total byte count end
#define RB_SPI_IE_BYTE_END 0x02 // RW, enable interrupt for SPI byte exchanged
#define RB_SPI_IE_FIFO_HF 0x04  // RW, enable interrupt for SPI FIFO half
#define RB_SPI_IE_DMA_END 0x08  // RW, enable interrupt for SPI0 DMA completion
#define RB_SPI_IE_FIFO_OV 0x10  // RW, enable interrupt for SPI0 FIFO overflow
#define RB_SPI_IE_FST_BYTE 0x80 // RW, enable interrupt for SPI0 slave mode first byte received
#define SPI_CLOCK_DIV 3
#define SPI_SLAVE_PRESET 3
#define SPI_BUFFER 4
#define SPI_RUN_FLAG 5
#define RB_SPI_SLV_CMD_ACT 0x10 // RO, SPI0 slave first byte / command flag
#define RB_SPI_FIFO_READY 0x20  // RO, SPI FIFO ready status
#define RB_SPI_SLV_CS_LOAD 0x40 // RO, SPI0 slave chip-select loading status
#define RB_SPI_SLV_SELECT 0x80  // RO, SPI0 slave selection status
#define SPI_INT_FLAG 6
#define RB_SPI_IF_CNT_END 0x01  // RW1, interrupt flag for SPI total byte count end
#define RB_SPI_IF_BYTE_END 0x02 // RW1, interrupt flag for SPI byte exchanged
#define RB_SPI_IF_FIFO_HF 0x04  // RW1, interrupt flag for SPI FIFO half (RB_SPI_FIFO_DIR ? >=4bytes : <4bytes)
#define RB_SPI_IF_DMA_END 0x08  // RW1, interrupt flag for SPI0 DMA completion
#define RB_SPI_IF_FIFO_OV 0x10  // RW1, interrupt flag for SPI0 FIFO overflow
#define RB_SPI_FREE 0x40        // RO, current SPI free status
#define RB_SPI_IF_FST_BYTE 0x80 // RW1, interrupt flag for SPI0 slave mode first byte received
#define SPI_FIFO_COUNT 7
#define SPI_TOTAL_CNT 0x0C
#define SPI_FIFO 0x10
#define SPI_DMA_NOW 0x14
#define SPI_DMA_BEG 0x18
#define SPI_DMA_END 0x1C

/* PWM4/5/6/7/8/9/10/11 register */
#define R32_PWM_CONTROL (*((PUINT32V)0x40005000))  // RW, PWM control
#define R8_PWM_OUT_EN (*((PUINT8V)0x40005000))     // RW, PWM output enable control
#define R8_PWM_POLAR (*((PUINT8V)0x40005001))      // RW, PWM output polarity control
#define R8_PWM_CONFIG (*((PUINT8V)0x40005002))     // RW, PWM configuration
#define R8_PWM_CLOCK_DIV (*((PUINT8V)0x40005003))  // RW, PWM clock divisor
#define R32_PWM4_7_DATA (*((PUINT32V)0x40005004))  // RW, PWM4-7 data holding
#define R8_PWM4_DATA (*((PUINT8V)0x40005004))      // RW, PWM4 data holding
#define R8_PWM5_DATA (*((PUINT8V)0x40005005))      // RW, PWM5 data holding
#define R8_PWM6_DATA (*((PUINT8V)0x40005006))      // RW, PWM6 data holding
#define R8_PWM7_DATA (*((PUINT8V)0x40005007))      // RW, PWM7 data holding
#define R32_PWM8_11_DATA (*((PUINT32V)0x40005008)) // RW, PWM8-11 data holding
#define R8_PWM8_DATA (*((PUINT8V)0x40005008))      // RW, PWM8 data holding
#define R8_PWM9_DATA (*((PUINT8V)0x40005009))      // RW, PWM9 data holding
#define R8_PWM10_DATA (*((PUINT8V)0x4000500A))     // RW, PWM10 data holding
#define R8_PWM11_DATA (*((PUINT8V)0x4000500B))     // RW, PWM11 data holding

/* PWM4/5/6/7/8/9/10/11 register address offset and bit define */
#define BA_PWMX ((PUINT8V)0x40005000) // point PWM4/5/6/7/8/9/10/11 base address
#define PWM_OUT_EN 0
#define RB_PWM4_OUT_EN 0x01  // RW, PWM4 output enable
#define RB_PWM5_OUT_EN 0x02  // RW, PWM5 output enable
#define RB_PWM6_OUT_EN 0x04  // RW, PWM6 output enable
#define RB_PWM7_OUT_EN 0x08  // RW, PWM7 output enable
#define RB_PWM8_OUT_EN 0x10  // RW, PWM8 output enable
#define RB_PWM9_OUT_EN 0x20  // RW, PWM9 output enable
#define RB_PWM10_OUT_EN 0x40 // RW, PWM10 output enable
#define RB_PWM11_OUT_EN 0x80 // RW, PWM11 output enable
#define PWM_POLAR 1
#define RB_PWM4_POLAR 0x01  // RW, PWM4 output polarity: 0=default low and high action, 1=default high and low action
#define RB_PWM5_POLAR 0x02  // RW, PWM5 output polarity: 0=default low and high action, 1=default high and low action
#define RB_PWM6_POLAR 0x04  // RW, PWM6 output polarity: 0=default low and high action, 1=default high and low action
#define RB_PWM7_POLAR 0x08  // RW, PWM7 output polarity: 0=default low and high action, 1=default high and low action
#define RB_PWM8_POLAR 0x10  // RW, PWM8 output polarity: 0=default low and high action, 1=default high and low action
#define RB_PWM9_POLAR 0x20  // RW, PWM9 output polarity: 0=default low and high action, 1=default high and low action
#define RB_PWM10_POLAR 0x40 // RW, PWM10 output polarity: 0=default low and high action, 1=default high and low action
#define RB_PWM11_POLAR 0x80 // RW, PWM11 output polarity: 0=default low and high action, 1=default high and low action
#define PWM_CONFIG 2
#define RB_PWM_CYCLE_SEL 0x01    // RW, PWM cycle selection: 0=256/128/64/32 clocks, 1=255/127/63/31 clocks
#define RB_PWM_STAG_ST 0x02      // RO, PWM stagger cycle status
#define RB_PWM_CYC_MOD 0x0c      // RW, PWM data width mode: 00=8 bits data, 01=7 bits data, 10=6 bits data, 11=5 bits data
#define RB_PWM4_5_STAG_EN 0x10   // RW, PWM4/5 stagger output enable: 0=independent output, 1=stagger output
#define RB_PWM6_7_STAG_EN 0x20   // RW, PWM6/7 stagger output enable: 0=independent output, 1=stagger output
#define RB_PWM8_9_STAG_EN 0x40   // RW, PWM8/9 stagger output enable: 0=independent output, 1=stagger output
#define RB_PWM10_11_STAG_EN 0x80 // RW, PWM10/11 stagger output enable: 0=independent output, 1=stagger output
#define PWM_CLOCK_DIV 3
#define PWM4_DATA_HOLD 4
#define PWM5_DATA_HOLD 5
#define PWM6_DATA_HOLD 6
#define PWM7_DATA_HOLD 7
#define PWM8_DATA_HOLD 8
#define PWM9_DATA_HOLD 9
#define PWM10_DATA_HOLD 10
#define PWM11_DATA_HOLD 11

/* LED register */
#define R32_LED_CONTROL (*((PUINT32V)0x40006400))  // RW, LED control
#define R8_LED_CTRL_MOD (*((PUINT8V)0x40006400))   // RW, LED mode control
#define R8_LED_CLOCK_DIV (*((PUINT8V)0x40006401))  // RW, LED serial clock divisor
#define R8_LED_STATUS (*((PUINT8V)0x40006404))     // RO, LED status
#define R32_LED_FIFO (*((PUINT32V)0x40006408))     // WO, LED FIFO register, width is half-word, only low 16 bit
#define R16_LED_FIFO (*((PUINT16V)0x40006408))     // WO, LED FIFO register, width is half-word
#define R32_LED_DMA_CNT (*((PUINT32V)0x40006410))  // RW, LED DMA main buffer remainder half-word count, exclude auxiliary buffer, automatic decreasing after DMA, only low 12 bit
#define R16_LED_DMA_CNT (*((PUINT16V)0x40006410))  // RW, LED DMA main buffer remainder half-word count, exclude auxiliary buffer, automatic decreasing after DMA, only low 12 bit
#define R32_LED_DMA_MAIN (*((PUINT32V)0x40006414)) // RW, LED main buffer DMA begin & current address, automatic increasing after DMA
#define R16_LED_DMA_MAIN (*((PUINT16V)0x40006414)) // RW, LED main buffer DMA begin & current address, automatic increasing after DMA
#define R32_LED_DMA_AUX (*((PUINT32V)0x40006418))  // RW, LED auxiliary buffer DMA begin & current address, automatic increasing after DMA
#define R16_LED_DMA_AUX (*((PUINT16V)0x40006418))  // RW, LED auxiliary buffer DMA begin & current address, automatic increasing after DMA

/* LED register address offset and bit define */
#define LED_FIFO_SIZE 2              // LED FIFO size (depth), width is half-word
#define BA_LED ((PUINT8V)0x40006400) // point LED base address
#define LED_CTRL_MOD 0
#define RB_LED_BIT_ORDER 0x01 // RW, LED bit data order: 0=LSB first, 1=MSB first
#define RB_LED_ALL_CLEAR 0x02 // RW, force clear LED FIFO and count
#define RB_LED_OUT_POLAR 0x04 // RW, LED output polarity: 0=pass, 1=invert
#define RB_LED_OUT_EN 0x08    // RW, LED output enable
#define RB_LED_DMA_EN 0x10    // RW, LED DMA enable and DMA interrupt enable
#define RB_LED_IE_FIFO 0x20   // RW, enable interrupt for LED FIFO <=2
#define RB_LED_CHAN_MOD 0xC0  // RW, LED channel mode: 00=LED0, 01=LED0/1, 10=LED0~3, 11=LED0~3 and LED2/3 from auxiliary buffer
// RB_LED_CHAN_MOD: LED channel mode
//   00: single channel output, LED0
//   01: dual channels output, LED0/1
//   10: 4 channels output, LED0~3
//   11: 4 channels output and LED2/3 from aux buffer, LED0~3
#define LED_CLOCK_DIV 1
#define LED_STATUS 4
#define RB_LED_FIFO_COUNT 0x07 // RO, LED FIFO byte count status, must divided by 2 for width half-word
#define RB_LED_CLOCK 0x10      // RO, current LED clock level
#define RB_LED_IF_FIFO 0x20    // RW1, interrupt flag for LED FIFO <=2, cleared by RW1 or write R32/R16_LED_FIFO
#define RB_LED_FIFO_EMPTY 0x40 // RO: indicate FIFO empty status
#define RB_LED_IF_DMA_END 0x80 // RW1, interrupt flag for LED DMA completion, cleared by RW1 or write R32/R16_LED_DMA_CNT
#define LED_FIFO 8
#define LED_DMA_CNT 0x10
#define LED_DMA_BEG 0x14
#define LED_DMA_END 0x18

