HaiMianBBao/PlumBL/PlumUSB/port/ch579/ch579_regs.h
/* LCD register */
#define R32_LCD_CONTROL (*((PUINT32V)(0x40006000)))
#define R8_LCD_CTRL_MOD (*((PUINT8V)(0x40006000)))
#define RB_SYS_POWER_ON 0x01 // RW, LCD digital system enable
#define RB_LCD_POWER_ON 0x02 // RW, LCD analog system enable
#define RB_LCD_BIAS 0x04     // RW, LCD bias select:  0=1/2 bias,  1=1/3 bias
#define RB_LCD_DUTY 0x18     // RW, LCD duty select:  00=1/2 duty,  01=1/3 duty,  10=1/4 duty
#define RB_LCD_SCAN_CLK 0x60 // RW, LCD scan clock select: 00=256Hz, 01=512Hz, 10=1KHz, 11=128Hz
#define RB_LCD_V_SEL 0x80    // RW, LCD drive voltage：0=VIO33*100%(3.3V),1=VIO33*76%(2.5V)

#define R32_LCD_RAM0 (*((PUINT32V)(0x40006004))) // RW, LCD driver data0, address 0-3
#define R32_LCD_RAM1 (*((PUINT32V)(0x40006008))) // RW, LCD driver data1, address 4-7
#define R32_LCD_RAM2 (*((PUINT32V)(0x4000600C))) // RW, LCD driver data2, address 8-12

/* Address space define */
#define BA_CODE ((PUINT32)0x00000000) // point code base address
#define SZ_CODE 0x00040000            // code size
#define BA_SFR ((PUINT32)0x40000000)  // point SFR base address
#define SZ_SFR 0x00010000             // SFR size
#define BA_RAM ((PUINT32)0x20000000)  // point RAM base address
#define SZ_RAM 0x00008000             // RAM size
#define BA_PPB ((PUINT32)0xE0000000)  // point PPB base address
#define SZ_PPB 0x00010000             // PPB size

/* Special Program Space */
#define DATA_FLASH_ADDR 0x3E800 // start address of Data-Flash
#define DATA_FLASH_SIZE 0x0800  // size of Data-Flash
#define BOOT_LOAD_ADDR 0x3F000  // start address of boot loader program
#define BOOT_LOAD_SIZE 0x1000   // size of boot loader program
#define BOOT_LOAD_CFG 0x40000   // start address of configuration information for boot loader program
#define ROM_CFG_ADDR 0x40010    // chip configuration information address

/*----- Reference Information --------------------------------------------*/
#define ID_CH579 0x79 // chip ID

/* Interrupt routine address and interrupt number */
#define INT_ID_TMR0 0                                               // interrupt number for Timer0
#define INT_ID_GPIO 1                                               // interrupt number for GPIO
#define INT_ID_SLAVE 2                                              // interrupt number for Slave
#define INT_ID_SPI0 3                                               // interrupt number for SPI0
#define INT_ID_BLEB 4                                               // interrupt number for BLEBB
#define INT_ID_BLEL 5                                               // interrupt number for BLELLE
#define INT_ID_USB 6                                                // interrupt number for USB
#define INT_ID_ETH 7                                                // interrupt number for ETH
#define INT_ID_TMR1 8                                               // interrupt number for Timer1
#define INT_ID_TMR2 9                                               // interrupt number for Timer2
#define INT_ID_UART0 10                                             // interrupt number for UART0
#define INT_ID_UART1 11                                             // interrupt number for UART1
#define INT_ID_RTC 12                                               // interrupt number for RTC
#define INT_ID_ADC 13                                               // interrupt number for ADC and TouchKey
#define INT_ID_SPI1 14                                              // interrupt number for SPI1
#define INT_ID_LED 15                                               // interrupt number for LED
#define INT_ID_TMR3 16                                              // interrupt number for Timer3
#define INT_ID_UART2 17                                             // interrupt number for UART2
#define INT_ID_UART3 18                                             // interrupt number for UART3
#define INT_ID_WDOG_BAT 19                                          // interrupt number for Watch-Dog timer and Battery low voltage
#define INT_VEC_ENTRY_SZ 4                                          // size of each interrupt vector entry
#define INT_ADDR_TMR0 (INT_ID_TMR0 * INT_VEC_ENTRY_SZ + 64)         // interrupt vector address for Timer0
#define INT_ADDR_GPIO (INT_ID_GPIO * INT_VEC_ENTRY_SZ + 64)         // interrupt vector address for GPIO
#define INT_ADDR_SLAVE (INT_ID_SLAVE * INT_VEC_ENTRY_SZ + 64)       // interrupt vector address for Slave
#define INT_ADDR_SPI0 (INT_ID_SPI0 * INT_VEC_ENTRY_SZ + 64)         // interrupt vector address for SPI0
#define INT_ADDR_BLEB (INT_ID_BLEB * INT_VEC_ENTRY_SZ + 64)         // interrupt vector address for BLEBB
#define INT_ADDR_BLEL (INT_ID_BLEL * INT_VEC_ENTRY_SZ + 64)         // interrupt vector address for BLELLE
#define INT_ADDR_USB (INT_ID_USB * INT_VEC_ENTRY_SZ + 64)           // interrupt vector address for USB
#define INT_ADDR_ETH (INT_ID_ETH * INT_VEC_ENTRY_SZ + 64)           // interrupt vector address for ETH
#define INT_ADDR_TMR1 (INT_ID_TMR1 * INT_VEC_ENTRY_SZ + 64)         // interrupt vector address for Timer1
#define INT_ADDR_TMR2 (INT_ID_TMR2 * INT_VEC_ENTRY_SZ + 64)         // interrupt vector address for Timer2
#define INT_ADDR_UART0 (INT_ID_UART0 * INT_VEC_ENTRY_SZ + 64)       // interrupt vector address for UART0
#define INT_ADDR_UART1 (INT_ID_UART1 * INT_VEC_ENTRY_SZ + 64)       // interrupt vector address for UART1
#define INT_ADDR_RTC (INT_ID_RTC * INT_VEC_ENTRY_SZ + 64)           // interrupt vector address for RTC
#define INT_ADDR_AD (INT_ID_ADC * INT_VEC_ENTRY_SZ + 64)            // interrupt vector address for ADC and TouchKey
#define INT_ADDR_SPI1 (INT_ID_SPI1 * INT_VEC_ENTRY_SZ + 64)         // interrupt vector address for SPI1
#define INT_ADDR_LED (INT_ID_LED * INT_VEC_ENTRY_SZ + 64)           // interrupt vector address for LED
#define INT_ADDR_Timer3 (INT_ID_Timer3 * INT_VEC_ENTRY_SZ + 64)     // interrupt vector address for Timer3
#define INT_ADDR_UART2 (INT_ID_UART2 * INT_VEC_ENTRY_SZ + 64)       // interrupt vector address for UART2
#define INT_ADDR_UART3 (INT_ID_UART3 * INT_VEC_ENTRY_SZ + 64)       // interrupt vector address for UART3
#define INT_ADDR_WDOG_BAT (INT_ID_WDOG_BAT * INT_VEC_ENTRY_SZ + 64) // interrupt vector address for Watch-Dog timer and Battery low voltage

