HaiMianBBao/PlumBL/PlumUSB/port/ch579/ch579_regs.h
#define R8_UEP2_3_MOD (*((PUINT8V)(0x4000800d))) // endpoint 2/3 mode
#define RB_UEP3_RX_EN 0x80                       // enable USB endpoint 3 receiving (OUT)
#define RB_UEP3_TX_EN 0x40                       // enable USB endpoint 3 transmittal (IN)
#define RB_UEP3_BUF_MOD 0x10                     // buffer mode of USB endpoint 3
#define RB_UEP2_RX_EN 0x08                       // enable USB endpoint 2 receiving (OUT)
#define RB_UEP2_TX_EN 0x04                       // enable USB endpoint 2 transmittal (IN)
#define RB_UEP2_BUF_MOD 0x01                     // buffer mode of USB endpoint 2

#define R8_UH_EP_MOD R8_UEP2_3_MOD // host endpoint mode
#define RB_UH_EP_TX_EN 0x40        // enable USB host OUT endpoint transmittal
#define RB_UH_EP_TBUF_MOD 0x10     // buffer mode of USB host OUT endpoint
// bUH_EP_TX_EN & bUH_EP_TBUF_MOD: USB host OUT endpoint buffer mode, buffer start address is UH_TX_DMA
//   0 x:  disable endpoint and disable buffer
//   1 0:  64 bytes buffer for transmittal (OUT endpoint)
//   1 1:  dual 64 bytes buffer by toggle bit bUH_T_TOG selection for transmittal (OUT endpoint), total=128bytes
#define RB_UH_EP_RX_EN 0x08    // enable USB host IN endpoint receiving
#define RB_UH_EP_RBUF_MOD 0x01 // buffer mode of USB host IN endpoint
    // bUH_EP_RX_EN & bUH_EP_RBUF_MOD: USB host IN endpoint buffer mode, buffer start address is UH_RX_DMA
    //   0 x:  disable endpoint and disable buffer
    //   1 0:  64 bytes buffer for receiving (IN endpoint)
    //   1 1:  dual 64 bytes buffer by toggle bit bUH_R_TOG selection for receiving (IN endpoint), total=128bytes

#define R16_UEP0_DMA (*((PUINT16V)(0x40008010)))     // endpoint 0 DMA buffer address
#define R16_UEP1_DMA (*((PUINT16V)(0x40008014)))     // endpoint 1 DMA buffer address
#define R16_UEP2_DMA (*((PUINT16V)(0x40008018)))     // endpoint 2 DMA buffer address
#define R16_UH_RX_DMA R16_UEP2_DMA                   // host rx endpoint buffer high address
#define R16_UEP3_DMA (*((PUINT16V)(0x4000801C)))     // endpoint 3 DMA buffer address
#define R16_UH_TX_DMA R16_UEP3_DMA                   // host tx endpoint buffer high address
#define R32_USB_EP0_CTRL (*((PUINT32V)(0x40008020))) // endpoint 0 control & transmittal length
#define R8_UEP0_T_LEN (*((PUINT8V)(0x40008020)))     // endpoint 0 transmittal length
#define R8_UEP0_CTRL (*((PUINT8V)(0x40008022)))      // endpoint 0 control
#define R32_USB_EP1_CTRL (*((PUINT32V)(0x40008024))) // endpoint 1 control & transmittal length
#define R8_UEP1_T_LEN (*((PUINT8V)(0x40008024)))     // endpoint 1 transmittal length
#define R8_UEP1_CTRL (*((PUINT8V)(0x40008026)))      // endpoint 1 control
#define RB_UEP_R_TOG 0x80                            // expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1
#define RB_UEP_T_TOG 0x40                            // prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1
#define RB_UEP_AUTO_TOG 0x10                         // enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle
#define RB_UEP_R_RES1 0x08                           // handshake response type high bit for USB endpoint X receiving (OUT)
#define RB_UEP_R_RES0 0x04                           // handshake response type low bit for USB endpoint X receiving (OUT)
#define MASK_UEP_R_RES 0x0C                          // bit mask of handshake response type for USB endpoint X receiving (OUT)
#define UEP_R_RES_ACK 0x00
#define UEP_R_RES_TOUT 0x04
#define UEP_R_RES_NAK 0x08
#define UEP_R_RES_STALL 0x0C
// RB_UEP_R_RES1 & RB_UEP_R_RES0: handshake response type for USB endpoint X receiving (OUT)
//   00: ACK (ready)
//   01: no response, time out to host, for non-zero endpoint isochronous transactions
//   10: NAK (busy)
//   11: STALL (error)
#define RB_UEP_T_RES1 0x02  // handshake response type high bit for USB endpoint X transmittal (IN)
#define RB_UEP_T_RES0 0x01  // handshake response type low bit for USB endpoint X transmittal (IN)
#define MASK_UEP_T_RES 0x03 // bit mask of handshake response type for USB endpoint X transmittal (IN)
#define UEP_T_RES_ACK 0x00
#define UEP_T_RES_TOUT 0x01
#define UEP_T_RES_NAK 0x02
#define UEP_T_RES_STALL 0x03
    // bUEP_T_RES1 & bUEP_T_RES0: handshake response type for USB endpoint X transmittal (IN)
    //   00: DATA0 or DATA1 then expecting ACK (ready)
    //   01: DATA0 or DATA1 then expecting no response, time out from host, for non-zero endpoint isochronous transactions
    //   10: NAK (busy)
    //   11: STALL (error)

#define R8_UH_SETUP R8_UEP1_CTRL // host aux setup
#define RB_UH_PRE_PID_EN 0x80    // USB host PRE PID enable for low speed device via hub
#define RB_UH_SOF_EN 0x40        // USB host automatic SOF enable

#define R32_USB_EP2_CTRL (*((PUINT32V)(0x40008028))) // endpoint 2 control & transmittal length
#define R8_UEP2_T_LEN (*((PUINT8V)(0x40008028)))     // endpoint 2 transmittal length
#define R8_UEP2_CTRL (*((PUINT8V)(0x4000802a)))      // endpoint 2 control

#define R8_UH_EP_PID R8_UEP2_T_LEN // host endpoint and PID
#define MASK_UH_TOKEN 0xF0         // bit mask of token PID for USB host transfer
#define MASK_UH_ENDP 0x0F          // bit mask of endpoint number for USB host transfer

#define R8_UH_RX_CTRL R8_UEP2_CTRL // host receiver endpoint control
#define RB_UH_R_TOG 0x80           // expected data toggle flag of host receiving (IN): 0=DATA0, 1=DATA1
#define RB_UH_R_AUTO_TOG 0x10      // enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle
#define RB_UH_R_RES 0x04           // prepared handshake response type for host receiving (IN): 0=ACK (ready), 1=no response, time out to device, for isochronous transactions

#define R32_USB_EP3_CTRL (*((PUINT32V)(0x4000802c))) // endpoint 3 control & transmittal length
#define R8_UEP3_T_LEN (*((PUINT8V)(0x4000802c)))     // endpoint 3 transmittal length
#define R8_UEP3_CTRL (*((PUINT8V)(0x4000802e)))      // endpoint 3 control
#define R8_UH_TX_LEN R8_UEP3_T_LEN                   // host transmittal endpoint transmittal length

