HaiMianBBao/PlumBL/PlumUSB/port/ch579/ch579_regs.h
//    __PACKED typedef struct _USB_DEVICE_DESCR
//    {
//        UINT8 bLength;
//        UINT8 bDescriptorType;
//        UINT16 bcdUSB;
//        UINT8 bDeviceClass;
//        UINT8 bDeviceSubClass;
//        UINT8 bDeviceProtocol;
//        UINT8 bMaxPacketSize0;
//        UINT16 idVendor;
//        UINT16 idProduct;
//        UINT16 bcdDevice;
//        UINT8 iManufacturer;
//        UINT8 iProduct;
//        UINT8 iSerialNumber;
//        UINT8 bNumConfigurations;
//    } USB_DEV_DESCR, *PUSB_DEV_DESCR;

//    __PACKED typedef struct _USB_CONFIG_DESCR
//    {
//        UINT8 bLength;
//        UINT8 bDescriptorType;
//        UINT16 wTotalLength;
//        UINT8 bNumInterfaces;
//        UINT8 bConfigurationValue;
//        UINT8 iConfiguration;
//        UINT8 bmAttributes;
//        UINT8 MaxPower;
//    } USB_CFG_DESCR, *PUSB_CFG_DESCR;

//    __PACKED typedef struct _USB_INTERF_DESCR
//    {
//        UINT8 bLength;
//        UINT8 bDescriptorType;
//        UINT8 bInterfaceNumber;
//        UINT8 bAlternateSetting;
//        UINT8 bNumEndpoints;
//        UINT8 bInterfaceClass;
//        UINT8 bInterfaceSubClass;
//        UINT8 bInterfaceProtocol;
//        UINT8 iInterface;
//    } USB_ITF_DESCR, *PUSB_ITF_DESCR;

//    __PACKED typedef struct _USB_ENDPOINT_DESCR
//    {
//        UINT8 bLength;
//        UINT8 bDescriptorType;
//        UINT8 bEndpointAddress;
//        UINT8 bmAttributes;
//        UINT16 wMaxPacketSize;
//        UINT8 bInterval;
//    } USB_ENDP_DESCR, *PUSB_ENDP_DESCR;

//    __PACKED typedef struct _USB_CONFIG_DESCR_LONG
//    {
//        USB_CFG_DESCR cfg_descr;
//        USB_ITF_DESCR itf_descr;
//        USB_ENDP_DESCR endp_descr[1];
//    } USB_CFG_DESCR_LONG, *PUSB_CFG_DESCR_LONG;

//    typedef USB_CFG_DESCR_LONG *PXUSB_CFG_DESCR_LONG;

//    __PACKED typedef struct _USB_HUB_DESCR
//    {
//        UINT8 bDescLength;
//        UINT8 bDescriptorType;
//        UINT8 bNbrPorts;
//        UINT8 wHubCharacteristicsL;
//        UINT8 wHubCharacteristicsH;
//        UINT8 bPwrOn2PwrGood;
//        UINT8 bHubContrCurrent;
//        UINT8 DeviceRemovable;
//        UINT8 PortPwrCtrlMask;
//    } USB_HUB_DESCR, *PUSB_HUB_DESCR;

//    typedef USB_HUB_DESCR *PXUSB_HUB_DESCR;

//    __PACKED typedef struct _USB_HID_DESCR
//    {
//        UINT8 bLength;
//        UINT8 bDescriptorType;
//        UINT16 bcdHID;
//        UINT8 bCountryCode;
//        UINT8 bNumDescriptors;
//        UINT8 bDescriptorTypeX;
//        UINT8 wDescriptorLengthL;
//        UINT8 wDescriptorLengthH;
//    } USB_HID_DESCR, *PUSB_HID_DESCR;

//    typedef USB_HID_DESCR *PXUSB_HID_DESCR;

//    __PACKED typedef struct _UDISK_BOC_CBW
//    { /* command of BulkOnly USB-FlashDisk */
//        UINT32 mCBW_Sig;
//        UINT32 mCBW_Tag;
//        UINT32 mCBW_DataLen; /* uppest byte of data length, always is 0 */
//        UINT8 mCBW_Flag;     /* transfer direction and etc. */
//        UINT8 mCBW_LUN;
//        UINT8 mCBW_CB_Len;     /* length of command block */
//        UINT8 mCBW_CB_Buf[16]; /* command block buffer */
//    } UDISK_BOC_CBW, *PUDISK_BOC_CBW;

//    typedef UDISK_BOC_CBW *PXUDISK_BOC_CBW;

//    __PACKED typedef struct _UDISK_BOC_CSW
//    { /* status of BulkOnly USB-FlashDisk */
//        UINT32 mCSW_Sig;
//        UINT32 mCSW_Tag;
//        UINT32 mCSW_Residue; /* return: remainder bytes */ /* uppest byte of remainder length, always is 0 */
//        UINT8 mCSW_Status;                                 /* return: result status */
//    } UDISK_BOC_CSW, *PUDISK_BOC_CSW;

//    typedef UDISK_BOC_CSW *PXUDISK_BOC_CSW;

#ifdef __cplusplus
}
#endif

#endif // __USB_TYPE__
